{
  "articles": [
    {
      "paperId": "1b5b8bad07cc34a5307bdeab14d3edc789dc2bc9",
      "url": "https://www.semanticscholar.org/paper/1b5b8bad07cc34a5307bdeab14d3edc789dc2bc9",
      "title": "On the Approximation of the Bay of Bengal Domain to be Compatible for the Implementation of Finite Element Method",
      "abstract": "In this study, the Bay of Bengal domain has been approximated using triangular mesh so that the finite element method (FEM) can be employed on it. The area between 15º N and 23º N Latitudes and 85º E and 95º E Longitudes is considered as the physical domain. A MATLAB routine and the cubic spline interpolation have been used to extract the coordinates of the points on the boundary of the whole domain and the points on the boundary of the islands from a colour image of the domain. A C++ routine is used to generate an edp file for triangular mesh using the extracted coordinates. Then FreeFem++ is used to create triangular mesh for the whole domain from the generated edp file. All the major islands are also incorporated in the final mesh. The obtained triangular mesh can be used to develop a storm surge prediction model for the Bay of Bengal region implementing FEM.",
      "publicationDate": "2023-06-30",
      "authors": [
        {
          "authorId": "2221582952",
          "name": "Md. Masum Murshed"
        },
        {
          "authorId": "2221568608",
          "name": "Md. Morshed Bin Shiraj"
        },
        {
          "authorId": "2221569026",
          "name": "Md. Safik Ullah"
        },
        {
          "authorId": "2151615885",
          "name": "Md. Mizanur Rahman"
        },
        {
          "authorId": "2221568617",
          "name": "Md. Manik Hossain"
        }
      ]
    },
    {
      "paperId": "2d973c18ccbc8bf4daf0d075bf8084e330347213",
      "url": "https://www.semanticscholar.org/paper/2d973c18ccbc8bf4daf0d075bf8084e330347213",
      "title": "Viscoelectric effect analysis in an electroosmotic flow with microchannel wall slip",
      "abstract": "In the present work, we developed a numerical analysis for an electroosmotic flow circulating in a rectangular microchannel considering electrolyte viscosity as a function of the induced electric field; which is also reflected in the slip condition imposed on the system walls, since the slip length is a function of the fluid viscosity. It should be clarified this is an entirely hydrodynamic problem, and for this reason there are no induced pressure gradients, because we are in the presence of a purely electroosmotic flow, where the fluid motion is due only to electrokinetic forces. Based on these comments, the problem is centered on high induced potentials, enabling viscoelectric effect analysis in the electroosmotic flow, which leads to significant increases in velocity and volumetric flow profiles compared to the case where the viscosity is a constant and there is no slip condition. Due to analytical analysis limitations, we implemented a dimensionless equation scheme defined by the continuity equation, the momentum equations in the x and y direction, the Poisson-Boltzmann equation, and the charge conservation equation to obtain the velocity and volumetric flow rate profiles mentioned above. This model is described in its variational form in order to implement the finite element technique using free software, FreeFem++. The results obtained show how the viscoelectric effect is relevant when working with high induced potentials; that is, for values of ζ¯>1 , when the dimensionless viscoelectric parameter f¯ increases, there is a significant decrease in the velocity profiles u, a situation that is not observed when ζ¯≤1 , where there are low induced potentials, and for this reason, as the dimensionless parameter f¯ increases, the velocity profiles remain constant. This condition is preserved for different values of the slip length δ¯ .",
      "publicationDate": "2023-05-16",
      "authors": [
        {
          "authorId": "145457879",
          "name": "E. Ramos"
        },
        {
          "authorId": "104266825",
          "name": "I. Monsivais"
        },
        {
          "authorId": "143602325",
          "name": "F. Méndez"
        },
        {
          "authorId": "118337591",
          "name": "J. Lizardi"
        }
      ]
    },
    {
      "paperId": "92c221801f42e35da39d5feb106674f5f63a5c2e",
      "url": "https://www.semanticscholar.org/paper/92c221801f42e35da39d5feb106674f5f63a5c2e",
      "title": "Computational analysis of magnetic induced micropolar flow in a rectangular channel through FreeFem++",
      "abstract": "In this article, we aim to computationally analyze the magnetic induced micropolar flow in a rectangular channel using a multiphysics finite element solver, FreeFem++. In this respect, a physical model in the framework of the micropolar continuum is taken into consideration with appropriate boundary conditions. The flow is considered laminar and incompressible and moves under the application of an external magnetic field at the boundary of the flow channel. The flow governing equations of momentum, microrotation, and induction are derived, and their weak integral forms in the context of finite elements are presented. The developed finite element model is then implemented in FreeFem++ in order to compute numerical solutions to the corresponding boundary value problem. The effects of different physical parameters are studied and discussed in detail. The main findings of this investigation pertaining to different physical aspects are summarized in the conclusion. It is interesting to find that the present problem becomes unstable with specific choices of material parameters, thereby leading to an unstable solution by the direct solver. However, numerical experimentation suggests that an iterative solver based on the generalized minimum residual method can stabilize the numerical solutions. In this connection, results are shown for varying Hartmann numbers. Moreover, it is worth mentioning that FreeFEM++ provides an efficient platform to compute and analyze magnetic induced flow within the context of a higher order continuum.",
      "publicationDate": "2023-04-01",
      "authors": [
        {
          "authorId": "144332717",
          "name": "M. S. Khan"
        },
        {
          "authorId": "3063110",
          "name": "Isma Hameed"
        },
        {
          "authorId": "16124777",
          "name": "M. A. Memon"
        },
        {
          "authorId": "145223467",
          "name": "E. Bonyah"
        }
      ]
    },
    {
      "paperId": "ae3540a8fb14751a2c210d620249973fad1a1925",
      "url": "https://www.semanticscholar.org/paper/ae3540a8fb14751a2c210d620249973fad1a1925",
      "title": "Microwave tomographic imaging of shoulder injury",
      "abstract": "One of the most challenging shoulder injuries is rotator cuff tear that increases with aging and particularly happens among athletes. These tears cause pain and highly affect the functionality of the shoulder. The motivation of this work is detecting these tears by microwave tomographic imaging. This imaging method requires the solution of an inverse problem based on a minimization algorithm, with successive solutions of a direct problem. We make use of parallel computation from the domain decomposition method and domain-specific language with the open-source FreeFEM solver. Results demonstrate the possibility to detect tendon tear in a simplified shoulder model.",
      "publicationDate": "2023-03-26",
      "authors": [
        {
          "authorId": "1581605601",
          "name": "Sahar Borzooei"
        },
        {
          "authorId": "17158457",
          "name": "Pierre-Henri Tournier"
        },
        {
          "authorId": "2854725",
          "name": "C. Migliaccio"
        },
        {
          "authorId": "1815537",
          "name": "V. Dolean"
        },
        {
          "authorId": "48328542",
          "name": "C. Pichot"
        }
      ]
    },
    {
      "paperId": "8532d222ed475bf3b64f4566afc39bc771562c2a",
      "url": "https://www.semanticscholar.org/paper/8532d222ed475bf3b64f4566afc39bc771562c2a",
      "title": "E-Learning Proposal for 3D Modeling and Numerical Simulation with FreeFem++ for the Study of the Discontinuous Dynamics of Biological and Anaerobic Digesters",
      "abstract": "This work presents an original 3D code in FreeFem++ to recreate the behavior of anaerobic microorganisms in non-stirred anaerobic reactors with an intermittent feed. The physical and biochemical phenomena have been considered using a mathematical model based on a set of partial differential equations: Stokes, advection–diffusion, and diffusion–reaction. The description of the anaerobic metabolism was carried out by implementing the structured AMD1 model. The Galerkin finite element method has been used to solve the partial differential equations defined in the model. Finally, the methodology and procedures are presented by means of a concrete example. Thanks to the inclusion of this e-learning tool for use in virtual laboratories, it is possible to improve the understanding of engineering students on the functioning of the metabolism that takes place inside non-stirred anaerobic reactors that are fed discontinuously. This proposal reinforces to students, in a transversal way, both environmental sensitivity and awareness of the circular economy focused on the implementation of natural wastewater treatment systems in rural areas.",
      "publicationDate": "2023-03-18",
      "authors": [
        {
          "authorId": "1446651127",
          "name": "S. Brito-Espino"
        },
        {
          "authorId": "2145653839",
          "name": "Tania Garcia-Ramirez"
        },
        {
          "authorId": "1686772048",
          "name": "F. León-Zerpa"
        },
        {
          "authorId": "1446651155",
          "name": "C. Mendieta-Pino"
        },
        {
          "authorId": "32423291",
          "name": "J. J. Santana"
        },
        {
          "authorId": "1412329451",
          "name": "A. Ramos-Martín"
        }
      ]
    },
    {
      "paperId": "85d9c45abb4022d9350b7b3ba218e578f3aef2f0",
      "url": "https://www.semanticscholar.org/paper/85d9c45abb4022d9350b7b3ba218e578f3aef2f0",
      "title": "A Finite Element Toolbox for the Bogoliubov-De Gennes Stability Analysis of Bose-Einstein Condensates",
      "abstract": "We present a finite element toolbox for the computation of Bogoliubov-de Gennes modes used to assess the linear stability of stationary solutions of the Gross-Pitaevskii (GP) equation. Applications concern one (single GP equation) or two-component (a system of coupled GP equations) Bose-Einstein condensates in one, two and three dimensions of space. An implementation using the free software FreeFem++ is distributed with this paper. For the computation of the GP stationary (complex or real) solutions we use a Newton algorithm coupled with a continuation method exploring the parameter space (the chemical potential or the interaction constant). Bogoliubov-de Gennes equations are then solved using dedicated libraries for the associated eigenvalue problem. Mesh adaptivity is proved to considerably reduce the computational time for cases implying complex vortex states. Programs are validated through comparisons with known theoretical results for simple cases and numerical results reported in the literature.",
      "publicationDate": "2023-03-09",
      "authors": [
        {
          "authorId": "2643277",
          "name": "G. Sadaka"
        },
        {
          "authorId": "67210505",
          "name": "Victor Kalt"
        },
        {
          "authorId": "1823374",
          "name": "I. Danaila"
        },
        {
          "authorId": "1690488",
          "name": "F. Hecht"
        }
      ]
    },
    {
      "paperId": "84db6fb5ad9ba646d2c212b5e5b9a9558bf4a6ce",
      "url": "https://www.semanticscholar.org/paper/84db6fb5ad9ba646d2c212b5e5b9a9558bf4a6ce",
      "title": "Thermocapillary migration of a thin droplet on wettability-confined tracks",
      "abstract": "The thermocapillary migration of droplets on a solid surface is widely used in daily life and industrial fields. Regulating droplet thermocapillary migration by changing surface wettability have received extensive attention. Based on the lubrication theory and slip boundary conditions, we establish a mathematical model of the thermocapillary migration dynamics of a droplet on wettability-confined tracks subject to a uniform temperature gradient. Combined with the contact line dynamics, a method for determining the velocity of the contact line in different directions of the three-dimensional droplet is proposed, FreeFEM++ is employed for simulation coding. The evolution of droplet migration is examined, and the effects of track width and wettability on the droplet migration dynamics are emphatically investigated. The results show that the main part of the droplet moves from the high-temperature region to the low-temperature region, the trailing edge of the droplet forms a small bulge during the movement, and a thin liquid film is formed between the bulge and the main part of the droplet. The droplet spreading perpendicular to the track direction is inhibited and remains pinned after shrinking to the track edge. Negative correlation between the velocity of the advancing contact line and track width is observed. The velocity of the advancing line decreases rapidly at first and then slowly decrease to steady. The squeezing effect caused by the wettability confined in perpendicular to the track direction accelerates the thermocapillary migration of the droplet on the track at the initial short time. The enhanced track wettability increases the initial velocity of the receding contact line but has little effect on its stable value. The velocity of the advancing contact line is positively correlated with track wettability. Changing the track width is possibly easier to regulate the thermocapillary migration of a droplet than varying the track wettability.",
      "publicationDate": null,
      "authors": [
        {
          "authorId": "2189880866",
          "name": "Li Chun-Xi"
        },
        {
          "authorId": "2189885242",
          "name": "Ma Cheng"
        },
        {
          "authorId": "2177808534",
          "name": "Ye Xue-Min"
        }
      ]
    }
  ]
}