{
  "articles": [
    {
      "paperId": "7a35912dcbea1b4e2ea83b3979470ca34dba1c48",
      "url": "https://www.semanticscholar.org/paper/7a35912dcbea1b4e2ea83b3979470ca34dba1c48",
      "title": "МІКРОСЕРВІСНА АРХІТЕКТУРА СИСТЕМ СКІНЧЕННО-ЕЛЕМЕНТНОГО АНАЛІЗУ",
      "abstract": "У світі швидкого технологічного розвитку ефективність і гнучкість архітектур програмної інженерії відіграють ключову роль у створенні масштабованих і відмовостійких систем. Це набуває критичного значення для систем скінченно-елементного аналізу (FEA-систем), які використовуються для моделювання складних фізичних процесів в інженерії та часто повинні обробляти великі обсяги даних. Більшість сучасних FEA-систем використовують монолітну архітектуру – традиційну модель із єдиною кодовою базою для виконання різних функцій. Такий підхід має переваги, такі як єдине середовище розробки та легше налагодження взаємодії компонентів, і суттєві недоліки: складність масштабування, низьку відмовостійкість, погане балансування навантаження, зростання часу відповіді при збільшенні обсягів даних і складність впровадження нових функцій/технологій. Одним із можливих рішень є концепція мікросервісної архітектури, яка передбачає розбиття програмного забезпечення на невеликі незалежні компоненти (сервіси). Кожен сервіс виконує одну функцію і взаємодіє з іншими через чітко визначені інтерфейси. Оскільки вони працюють незалежно, їх можна оновлювати, змінювати, розгортати або масштабувати окремо. Це надає низку переваг: швидке розгортання, незалежність сервісів, гнучке окреме масштабування, стійкість до збоїв, технологічну гнучкість, кращу організацію та простоту тестування, переваги у хмарних середовищах. У статті порівнюються монолітні (Elmer FEM, FreeFEM), мікросервісні (SimScale) і хмарно-монолітні (ANSYS Cloud) FEA- системи за критеріями архітектури, масштабованості, відмовостійкості, розгортання та модифікації. Обґрунтовується перевага мікросервісного підходу та пропонується архітектура FEA-системи на основі патернів API Gateway, Aggregator, Database per Service, Event-Driven, Publisher/ Subscriber, Backend for Frontend.",
      "publicationDate": "2024-05-30",
      "authors": [
        {
          "authorId": "2304125705",
          "name": "Я. В. Кривий"
        },
        {
          "authorId": "2228086163",
          "name": "Антон Лісняк"
        }
      ]
    },
    {
      "paperId": "ea6ac9526d7f4981ac9fb2dbdbac5808558b4959",
      "url": "https://www.semanticscholar.org/paper/ea6ac9526d7f4981ac9fb2dbdbac5808558b4959",
      "title": "Accurate 3D modeling of laser-matter interaction in the AFP process by a conductive-radiative FEM approach",
      "abstract": "Abstract. Mainly driven by aeronautical demands, the Automated Fiber Placement (AFP) process has become pivotal in the in-situ manufacturing of intricate, high-performance composite components. AFP relies on robotic systems to meticulously lay continuous fiber-reinforced materials, employing controlled pressure and precise laser heating. Accurate thermal modeling is imperative to predict thermal effects impacting contact, adhesion, crystallinity, and residual constraints. This work introduces a novel numerical approach for efficient modeling the transient heat transfers in the AFP process using a coupled conductive-radiative finite element method (FEM) scheme. Radiative density from the laser-matter interaction is determined through an in-house parallelized FreeFEM++ code. Heat transfer at the micro-scale is assessed by using an artificial computational geometry based on fiber distributions obtained from tape micrograph. A parametric study with varying absorption coefficients of the carbon fibers is performed to accurately compute the radiative volumetric heat source. The proposed approach investigates various 2D and 3D scenarios involving different laser parameters. Results exhibit strong agreement with experimentally obtained data, showing a maximum temperature difference of 5-6°C at the end of the heating phase. Furthermore, a 3D case demonstrates the potential of this approach for modeling complex micro-scale geometries.",
      "publicationDate": "2024-05-15",
      "authors": [
        {
          "authorId": "2263528291",
          "name": "Bruno A. Storti"
        }
      ]
    },
    {
      "paperId": "b728dacd0b8bf96c8a346ab686b3e63f38c8dd98",
      "url": "https://www.semanticscholar.org/paper/b728dacd0b8bf96c8a346ab686b3e63f38c8dd98",
      "title": "Topology optimization of three-dimensional structures subject to self-weight loading",
      "abstract": "PurposeTopology optimization of structures under self-weight loading is a challenging problem which has received increasing attention in the past years. The use of standard formulations based on compliance minimization under volume constraint suffers from numerous difficulties for self-weight dominant scenarios, such as non-monotonic behaviour of the compliance, possible unconstrained character of the optimum and parasitic effects for low densities in density-based approaches. This paper aims to propose an alternative approach for dealing with topology design optimization of structures into three spatial dimensions subject to self-weight loading.Design/methodology/approachIn order to overcome the above first two issues, a regularized formulation of the classical compliance minimization problem under volume constraint is adopted, which enjoys two important features: (a) it allows for imposing any feasible volume constraint and (b) the standard (original) formulation is recovered once the regularizing parameter vanishes. The resulting topology optimization problem is solved with the help of the topological derivative method, which naturally overcomes the above last issue since no intermediate densities (grey-scale) approach is necessary.FindingsA novel and simple approach for dealing with topology design optimization of structures into three spatial dimensions subject to self-weight loading is proposed. A set of benchmark examples is presented, showing not only the effectiveness of the proposed approach but also highlighting the role of the self-weight loading in the final design, which are: (1) a bridge structure is subject to pure self-weight loading; (2) a truss-like structure is submitted to an external horizontal force (free of self-weight loading) and also to the combination of self-weight and the external horizontal loading; and (3) a tower structure is under dominant self-weight loading.Originality/valueAn alternative regularized formulation of the compliance minimization problem that naturally overcomes the difficulties of dealing with self-weight dominant scenarios; a rigorous derivation of the associated topological derivative; computational aspects of a simple FreeFEM implementation; and three-dimensional numerical benchmarks of bridge, truss-like and tower structures.",
      "publicationDate": "2024-04-02",
      "authors": [
        {
          "authorId": "2294492923",
          "name": "Jorge Morvan Marotte Luz Filho"
        },
        {
          "authorId": "2294493603",
          "name": "Antonio Andre Novotny"
        }
      ]
    },
    {
      "paperId": "d9314d2b1d2cc49778f6203e65ecf9091fea97a9",
      "url": "https://www.semanticscholar.org/paper/d9314d2b1d2cc49778f6203e65ecf9091fea97a9",
      "title": "Parallel finite-element codes for the Bogoliubov-de Gennes stability analysis of Bose-Einstein condensates",
      "abstract": "We present and distribute a parallel finite-element toolbox written in the free software FreeFem for computing the Bogoliubov-de Gennes (BdG) spectrum of stationary solutions to one- and two-component Gross-Pitaevskii (GP) equations, in two or three spatial dimensions. The parallelization of the toolbox relies exclusively upon the recent interfacing of FreeFem with the PETSc library. The latter contains itself a wide palette of state-of-the-art linear algebra libraries, graph partitioners, mesh generation and domain decomposition tools, as well as a suite of eigenvalue solvers that are embodied in the SLEPc library. Within the present toolbox, stationary states of the GP equations are computed by a Newton method. Branches of solutions are constructed using an adaptive step-size continuation algorithm. The combination of mesh adaptivity tools from FreeFem with the parallelization features from PETSc makes the toolbox efficient and reliable for the computation of stationary states. Their BdG spectrum is computed using the SLEPc eigenvalue solver. We perform extensive tests and validate our programs by comparing the toolbox's results with known theoretical and numerical findings that have been reported in the literature.",
      "publicationDate": "2024-04-01",
      "authors": [
        {
          "authorId": "2643277",
          "name": "Georges Sadaka"
        },
        {
          "authorId": "2294359921",
          "name": "Pierre Jolivet"
        },
        {
          "authorId": "8971754",
          "name": "E. Charalampidis"
        },
        {
          "authorId": "1823374",
          "name": "I. Danaila"
        }
      ]
    },
    {
      "paperId": "4f9312c8b466357fc9c39324f47e96bfc5f5d447",
      "url": "https://www.semanticscholar.org/paper/4f9312c8b466357fc9c39324f47e96bfc5f5d447",
      "title": "Stationary Flow of Incompressible Viscous Fluid Through a Two-Dimensional Branched Channel",
      "abstract": "The results of a numerical experiment for the problem of an incompressible viscous fluid stationary flow through a branched planar (two-dimensional) channel are presented. The region in which the flow occurs simulates either blood vessels or a river delta. The finite element method and a modification of the penalty method, as well as the splitting method, are used for calculations. The implementation of the calculation algorithm is using with the help the package FreeFem++. The main goal, in addition, of course, to study the properties and structure of the stationary flow, is to demonstrate the effectiveness of the proposed modification of the penalty method. It is assumed that the region has one input boundary section through which the liquid flows into the region, and several (five) boundary sections through which the liquid flows out of the region. The remaining sections of the region boundary are considered impermeable to liquid. The boundary condition corresponding to the Poiseuille flow in a plane rectilinear channel is set at the input section. Three types of boundary conditions are considered on the output boundary secctions. 1. The boundary conditions correspond to the conditions of conservation of motion of luid particles i. e. the material derivative of the velocity is zero. 2. The boundary conditions correspond to the setting of the flow velocity. 3. The boundary conditions correspond to the setting of the same pressure. The stationary solution is constructed by the relaxation method. In fact, a non-stationary problem is solved over a sufficiently large time interval. As an initial condition for a non-stationary problem, a flow is chosen that is a Poiseuille flow in some region near the input boundary. The dependence of the convergence rate of the relaxation method on the initial data is investigated. It is found that the Poiseuille flow, given at the input section of the boundary of the region, induces similar Poiseuille flows at the output boundaries sections of the region in all these cases of boundary conditions. For a region with five sections of the output boundaries for some configuration of the region, the presence of stationary vortex flows (‘maelstorm’) is found.",
      "publicationDate": "2024-03-29",
      "authors": [
        {
          "authorId": "2295381736",
          "name": "Elena V. Shiryaeva"
        },
        {
          "authorId": "2295378859",
          "name": "Alina S. Shokareva"
        },
        {
          "authorId": "2295381255",
          "name": "Valentina P. Sibil"
        }
      ]
    },
    {
      "paperId": "84abd0e326c0896fc698b4cba4dc61351108061e",
      "url": "https://www.semanticscholar.org/paper/84abd0e326c0896fc698b4cba4dc61351108061e",
      "title": "Density-Based Topological Optimization of 3D-Printed Casts for Fracture Treatment with Freefem Software",
      "abstract": "Abstract 3D printed plastic casts can be used for healing bone fractures. The main requirements for these cases are: they should be light, require little printing time, have good mechanical properties, and ensure proper skin ventilation. We present a density-based topology optimization algorithm for obtaining optimal cast shapes that fulfil these requirements. The algorithm uses a linear stress model and simplified boundary conditions to model the contact problems. The cast shapes were optimized against the influence of several sharp corners. The parametric studies showed that the mass of optimized casts was reduced by 20 %–25 % in comparison with original industrial casts, and the printing time is reduced by 1.4–1.7 h for the largest cast. A major model drawback is the use of 3D numerical volume to model the density distribution. The density distribution should be homogenized across the cast layer. The overhang problem should also be addressed. We also suggest that the cast producers collect more experimental data on the cast breakages for a better calibration of the numerical model.",
      "publicationDate": "2023-12-01",
      "authors": [
        {
          "authorId": "2273512708",
          "name": "K. Kokars"
        },
        {
          "authorId": "2273499963",
          "name": "A. Krauze"
        },
        {
          "authorId": "2273500087",
          "name": "K. Muiznieks"
        },
        {
          "authorId": "2248916308",
          "name": "J. Virbulis"
        },
        {
          "authorId": "2273508935",
          "name": "P. Verners"
        },
        {
          "authorId": "2273499906",
          "name": "A. Gutcaits"
        },
        {
          "authorId": "2273503707",
          "name": "J. Olins"
        }
      ]
    },
    {
      "paperId": "de167c589a7a334f2046a1687c24d6f7fa74eb15",
      "url": "https://www.semanticscholar.org/paper/de167c589a7a334f2046a1687c24d6f7fa74eb15",
      "title": "On the instability of travelling wave solutions for the transport-Stokes equation",
      "abstract": "In this paper, we investigate the instability of the spherical travelling wave solutions for the Transport-Stokes system in $\\mathbb{R}^3$. First, a classical scaling argument ensures instability among all probability measures for the Wasserstein metric and the $L^1$ norm. Secondly, we investigate the instability among patch solutions with a perturbed surface. To this end, we study the linearized system of a contour dynamics equation derived in [18] in the case where the support of the patch is axisymmetric and is described by spherical parametrization and show well-posedness of the linearized system. The actual version does not include the investigation of the eigenvalue and will be completed in the future. Eventually we investigate numerically the instability of the travelling wave by solving the Transport-Stokes equation using a finite element method on FreeFem.",
      "publicationDate": "2023-11-24",
      "authors": [
        {
          "authorId": "2118252",
          "name": "M. Bonnivard"
        },
        {
          "authorId": "7559530",
          "name": "Amina Mecherbet"
        }
      ]
    },
    {
      "paperId": "094ab826a7ae2cef8f8f2ba564b06d1117c88e30",
      "url": "https://www.semanticscholar.org/paper/094ab826a7ae2cef8f8f2ba564b06d1117c88e30",
      "title": "Optimal Control Strategies for Mitigating Urban Heat Island Intensity in Porous Urban Environments",
      "abstract": "This work is intended as an attempt to explore the use of optimal control techniques for designing green spaces and for dealing with the environmental problems related to urban heat islands appearing in cities. A three-dimensional model is established for numerical studies of the effects of urban anthropogenic heat and wind velocity in urban and rural regions. The transport mechanism of fluid in the cities is governed by the Navier–Stokes–Forschheimer porous media system. We introduce the penalty approximation method to overcome the difficulty induced by the incompressibility constraint. The partial differential equation optimal control problem is solved by using a Spectral Projected Gradient algorithm. To validate the method, we implement a numerical scheme, based on a finite element method, employing the free software FreeFem++ 14.3. We show the results for the optimized and non-optimized situations to compare the two cases.",
      "publicationDate": "2023-11-23",
      "authors": [
        {
          "authorId": "2268151043",
          "name": "Nacer Sellila"
        },
        {
          "authorId": "92921711",
          "name": "M. Louaked"
        },
        {
          "authorId": "2268152057",
          "name": "Waleed Mouhali"
        },
        {
          "authorId": "2903234",
          "name": "Houari Mechkour"
        }
      ]
    },
    {
      "paperId": "cb1d662f92b1bb4f58546402fed2e2af37307025",
      "url": "https://www.semanticscholar.org/paper/cb1d662f92b1bb4f58546402fed2e2af37307025",
      "title": "Structure-preserving semi-convex-splitting numerical scheme for a Cahn-Hilliard cross-diffusion system in lymphangiogenesis",
      "abstract": "A fully discrete semi-convex-splitting finite-element scheme with stabilization for a Cahn-Hilliard cross-diffusion system is analyzed. The system consists of parabolic fourth-order equations for the volume fraction of the fiber phase and solute concentration, modeling pre-patterning of lymphatic vessel morphology. The existence of discrete solutions is proved, and it is shown that the numerical scheme is energy stable up to stabilization, conserves the solute mass, and preserves the lower and upper bounds of the fiber phase fraction. Numerical experiments in two space dimensions using FreeFEM illustrate the phase segregation and pattern formation.",
      "publicationDate": "2023-11-19",
      "authors": [
        {
          "authorId": "3051005",
          "name": "A. Jüngel"
        },
        {
          "authorId": "2267335351",
          "name": "Boyi Wang"
        }
      ]
    },
    {
      "paperId": "66f559f652749bae0598e80ffa668dab950aa4e8",
      "url": "https://www.semanticscholar.org/paper/66f559f652749bae0598e80ffa668dab950aa4e8",
      "title": "COMBINED HORMONE AND BRACHY THERAPIES FOR THE TREATMENT OF PROSTATE CANCER",
      "abstract": "Prostate cancer is a hormone-dependent cancer characterized by two types of cancer cells, androgen-dependent cancer cells and androgen-resistant ones. The objective of this paper is to present a novel mathematical model for the treatment of prostate cancer under combined hormone therapy and brachytherapy. Using a system of partial differential equations, we quantify and study the evolution of the different cell densities involved in prostate cancer and their responses to the two treatments. Numerical simulations of tumor growth under different therapeutic strategies are explored and presented. The numerical simulations are carried out on FreeFem++ using a 2D finite element method.",
      "publicationDate": "2023-11-17",
      "authors": [
        {
          "authorId": "2099719009",
          "name": "S. Chabbar"
        },
        {
          "authorId": "1962608",
          "name": "A. Habbal"
        },
        {
          "authorId": "145544671",
          "name": "R. Aboulaich"
        },
        {
          "authorId": "2267115213",
          "name": "Nabil Ismaili"
        },
        {
          "authorId": "7262772",
          "name": "Sanaa El Majjaoui"
        }
      ]
    }
  ]
}