{
  "articles": [
    {
      "paperId": "de0ddea1299ea3af897f9424332ba221366d632b",
      "url": "https://www.semanticscholar.org/paper/de0ddea1299ea3af897f9424332ba221366d632b",
      "title": "Mathematical and numerical analysis of Koiter elliptic shells in normal compliance contact",
      "openAccessPdf": {
        "url": "",
        "status": null,
        "license": null,
        "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1177/10812865251400629?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1177/10812865251400629, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
      },
      "publicationDate": "2025-12-26",
      "authors": [
        {
          "authorId": "102207750",
          "name": "Á. Arós"
        },
        {
          "authorId": "2401414437",
          "name": "Ariel L. Lombardi"
        },
        {
          "authorId": "102457451",
          "name": "L. Venturato"
        }
      ],
      "abstract": "We consider a model for Koiter linear elastic elliptic shells in contact with a deformable obstacle and we study the convergence of the solution of this model towards the solution of the corresponding model for elastic elliptic membrane shells when the small parameter of the model (thickness) tends to zero. Furthermore, we propose a numerical scheme for this kind of contact problems for Koiter shells and show numerical simulations after implementation by using the free software package FreeFem++."
    },
    {
      "paperId": "b3a8bdd45fdd89979e483dcaca7901bfe47f5d25",
      "url": "https://www.semanticscholar.org/paper/b3a8bdd45fdd89979e483dcaca7901bfe47f5d25",
      "title": "РЕШЕНИЕ МЕТОДОМ КОНЕЧНЫХ ЭЛЕМЕНТОВ КРАЕВОЙ ЗАДАЧИ ДЛЯ ЭЛЛИПТИЧЕСКОГО УРАВНЕНИЯ С ДЕЛЬТА-ФУНКЦИЕЙ ДИРАКА В ПРАВОЙ ЧАСТИ",
      "openAccessPdf": {
        "url": "",
        "status": null,
        "license": null,
        "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.15372/sjnm20250403?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.15372/sjnm20250403, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
      },
      "publicationDate": "2025-11-30",
      "authors": [
        {
          "authorId": "148518408",
          "name": "Д. Н. Романов"
        },
        {
          "authorId": "2135865116",
          "name": "М.В. Урев"
        }
      ],
      "abstract": "В данной работе на примере уравнения Пуассона рассматриваются вопросы численного решения методом конечных элементов однородной краевой задачи Дирихле для эллиптического уравнения в двумерной многоугольной выпуклой области Ω с сингулярной правой частью в виде дельта-функции Дирака. Доказана теорема существования и единственности обобщенного решения в дробном гильбертовом пространстве Соболева Hs(Ω), где 1/2 < s < 1. Предложен и изучен подход к дискретному анализу задачи методом конечных элементов. Приведены результаты численных экспериментов по решению методической задачи с помощью пакета FreeFem++, подтверждающие полученную оценку уклонения дискретного решения от точного.\n A numerical solution by the finite element method of a homogeneous Dirichlet boundary value problem for an elliptic equation is examined (using a Poisson equation as an example) in a two-dimensional convex polygonal domain Ω with a singular right-hand side given by the Dirac delta function. A theorem on the existence and uniqueness of a generalized solution in the fractional Sobolev space Hs(Ω), 1/2 < s < 1, is proved. An approach to discrete analysis of the problem using the finite element method is proposed and investigated. The results of numerical experiments for a model problem, obtained using the FreeFem++ software, are presented. They confirm the error estimate of the difference between the discrete and exact solutions derived in the paper."
    },
    {
      "paperId": "d12fbf112232ecceccd8ca1a5ee5db166149a432",
      "url": "https://www.semanticscholar.org/paper/d12fbf112232ecceccd8ca1a5ee5db166149a432",
      "title": "ЗАСТОСУВАННЯ МАТЕМАТИЧНОГО АПАРАТУ ОБЧИСЛЮВАЛЬНОЇ ГІДРОДИНАМІКИ ДЛЯ ДОСЛІДЖЕННЯ ПРОЦЕСІВ ГРАВІТАЦІЙНОГО ЗБАГАЧЕННЯ МАГНЕТИТОВИХ РУД У СПІРАЛЬНИХ СЕПАРАТОРАХ",
      "openAccessPdf": {
        "url": "",
        "status": null,
        "license": null,
        "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.32782/3041-2080/2025-5-32?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.32782/3041-2080/2025-5-32, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
      },
      "publicationDate": "2025-11-10",
      "authors": [
        {
          "authorId": "2380177353",
          "name": "Тетяна Анатоліївна Олійник"
        },
        {
          "authorId": "2392094049",
          "name": "Людмила Василівна Скляр"
        },
        {
          "authorId": "2392091365",
          "name": "Дмитро Олександрович Румницький"
        }
      ],
      "abstract": "На прикладі визначення швидкості вільного та стисненого падіння частинок встановлена можливість використання методів обчислювальної гідродинаміки для моделювання процесу осадження мінеральних частинок у рідині та визначення швидкості їх падіння. Показано, що ефективність розділення у спіральних сепараторах суттєво залежить від взаємозв’язку розміру та густини частинок. Збільшення діаметра частинок зменшує вплив турбулентних коливань потоку, що сприяє стабілізації їх траєкторій і забезпечує більш чіткий поділ фракцій. Проведене чисельне моделювання із застосуванням методу скінченних елементів (FEM) у середовищі FreeFEM++ дало змогу визначити гідродинамічні та кінематичні характеристики потоку, які можуть бути використані для оптимізації конструктивних параметрів та режимів роботи спіральних сепараторів задля підвищення селективності процесу гравітаційного збагачення магнетитових руд. Побудова тривимірної моделі потоку відкрила можливості для детального аналізу зон турбулентності, локального збагачення та розподілу концентрацій по ширині каналу. Такі дослідження можуть бути розширені у програмних комплексах OpenFOAM або COMSOL, що підтримують обмін даними з FreeFEM++ через формат mesh-файлів. Результати моделювання були підтверджені фізичними експериментами на спіральному сепараторі СВШ-2-1000, який має параболічну геометрію поперечного перерізу, та сепараторі лабораторного масштабу з профілем поперечного перерізу у вигляді кривої слабко похилої. Лабораторний сепаратор забезпечує отримання концентрату з вищими показниками виходу, вмісту та вилучення магнетиту (до 85,4 %). Втрати магнетиту з хвостами становили 12,5 % для лабораторного апарата СВШ-2-1000 і не перевищували 3 %. Отримані результати свідчать про високу узгодженість чисельних розрахунків і експериментальних даних. Підтверджують перспективність використання обчислювальної гідродинаміки для дослідження та оптимізації процесів гравітаційного збагачення у спіральних сепараторах."
    },
    {
      "paperId": "c44b86771435f418a277baf2b20776d1cb8ab06c",
      "url": "https://www.semanticscholar.org/paper/c44b86771435f418a277baf2b20776d1cb8ab06c",
      "title": "PHƯƠNG PHÁP PHẦN TỬ HỮU HẠN KHÔNG – THỜI GIAN GIẢI XẤP XỈ PHƯƠNG TRÌNH PHẢN ỨNG KHUẾCH TÁN",
      "openAccessPdf": {
        "url": "",
        "status": null,
        "license": null,
        "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.54607/hcmue.js.22.10.4940(2025)?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.54607/hcmue.js.22.10.4940(2025), which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
      },
      "publicationDate": "2025-10-30",
      "authors": [
        {
          "authorId": "2399426569",
          "name": "Phi Hùng Phạm"
        },
        {
          "authorId": "2328919122",
          "name": "Thị Tuyết Nhung Mai"
        },
        {
          "authorId": "2222823444",
          "name": "Thị Thanh Mơ Tạ"
        }
      ],
      "abstract": "Trong bài báo này chúng tôi trình bày phương pháp phần tử hữu hạn không-thời gian (space-time finite element method) giải xấp xỉ phương trình phản ứng khuếch tán. Khác với các phương pháp số truyền thống phân tách xấp xỉ miền thời gian và không gian riêng biệt, phương pháp này rời rạc đồng thời miền Q = Ω × (0, T ) trên cùng một cấu trúc lưới, giúp tối ưu chi phí tính toán và nâng cao độ chính xác của nghiệm xấp xỉ. Cách tiếp cận của phương pháp là đưa bài toán ban đầu về dạng biến phân (bài toán yếu). Tính đặt chỉnh của bài toán yếu được chứng minh thông qua việc áp dụng định lí Banach–Nečas–Babuška, đảm bảo sự tồn tại, duy nhất nghiệm. Phân tích đánh giá sai số tiên nghiệm (a priori error estimates) cho thấy phương pháp đạt tốc độ hội tụ tối ưu trong không gian tương ứng. Tính hiệu quả và độ chính xác của phương pháp được kiểm chứng qua các thí nghiệm số được xây dựng trên phần mềm mã nguồn mở FreeFEM++."
    },
    {
      "paperId": "57b37c980f7305ce8d323bc946dfce96bf0cdd1a",
      "url": "https://www.semanticscholar.org/paper/57b37c980f7305ce8d323bc946dfce96bf0cdd1a",
      "title": "Spectral Bounds and Exit Times for a Stochastic Model of Corruption",
      "openAccessPdf": {
        "url": "",
        "status": null,
        "license": null,
        "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.3390/mca30050111?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.3390/mca30050111, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
      },
      "publicationDate": "2025-10-08",
      "authors": [
        {
          "authorId": "1402940621",
          "name": "J. Villa‐Morales"
        }
      ],
      "abstract": "We study a stochastic differential model for the dynamics of institutional corruption, extending a deterministic three-variable system—corruption perception, proportion of sanctioned acts, and policy laxity—by incorporating Gaussian perturbations into key parameters. We prove global existence and uniqueness of solutions in the physically relevant domain, and we analyze the linearization around the asymptotically stable equilibrium of the deterministic system. Explicit mean square bounds for the linearized process are derived in terms of the spectral properties of a symmetric matrix, providing insight into the temporal validity of the linear approximation. To investigate global behavior, we relate the first exit time from the domain of interest to backward Kolmogorov equations and numerically solve the associated elliptic and parabolic PDEs with FreeFEM, obtaining estimates of expectations and survival probabilities. An application to the case of Mexico highlights nontrivial effects: while the spectral structure governs local stability, institutional volatility can non-monotonically accelerate global exit, showing that highly reactive interventions without effective sanctions increase uncertainty. Policy implications and possible extensions are discussed."
    },
    {
      "paperId": "e35503581cb0d0302d8fd755efe8f34e3495e49d",
      "url": "https://www.semanticscholar.org/paper/e35503581cb0d0302d8fd755efe8f34e3495e49d",
      "title": "Mathematical Aspects of ANM/FEM Numerical Model, Applied to Nonlinear Elastic, and Thermo Elastic Analysis of Wrinkles in Film/Substrate Systems, and a New Implementation in the FreeFEM++ Language",
      "openAccessPdf": {
        "url": "",
        "status": null,
        "license": null,
        "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.3390/math13193063?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.3390/math13193063, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
      },
      "publicationDate": "2025-09-23",
      "authors": [
        {
          "authorId": "2222644275",
          "name": "Pascal Ventura"
        },
        {
          "authorId": "2372154995",
          "name": "Frédéric Hecht"
        },
        {
          "authorId": "2306286684",
          "name": "Michel Potier-Ferry"
        },
        {
          "authorId": "9703693",
          "name": "H. Zahrouni"
        },
        {
          "authorId": "2143944009",
          "name": "Fan Xu"
        },
        {
          "authorId": "2222935407",
          "name": "Hamza Azzayani"
        },
        {
          "authorId": "2301519254",
          "name": "Michael Brun"
        },
        {
          "authorId": "2212262477",
          "name": "Anh-Khoa Chau"
        }
      ],
      "abstract": "The main purposes of the present paper are to present the mathematical and algorithmic aspects of the ANM/FEM numerical model and to show how it is applied to analyze elastic and thermo-elastic nonlinear solid mechanical problems. ANM is a robust continuation method based on a perturbation technique for solving nonlinear problems dependent on a loading parameter. Historically, this technique has been successfully applied to problems in various fields of solid and fluid mechanics. This paper shows how ANM is used to solve nonlinear elastic and nonlinear thermo-elastic problems involving elastic behavior and geometrical nonlinearities. The implementation of ANM for FEM in the FreeFEM++ language is then presented. The FEM software development platform, called FreeFEM++, is structured to work with variational formulations and, therefore, is well adapted to implement ANM for instability problems in solid mechanics. In order to illustrate the great efficiency of FreeFEM++, scripts will be presented for computing the different steps of ANM continuation for solid elastic structures, considering simple geometries subjected to conservative loading. For the purpose of validation, the problem of a cantilever subjected to an applied force is presented. Next, the new numerical model is applied to study wrinkles appearing in a planar film/substrate system that is subjected to compressive surface forces at the lateral faces of the film. Finally, the model is applied to a spherical film/substrate system subjected to thermo-elastic shrinkage. In both cases, the ANM/FEM prediction method, together with a Newton–Riks correction (if needed), identifies the equilibrium paths efficiently, especially after the post-buckling regime."
    },
    {
      "paperId": "b65358d41ed4f6a06df8d0f89344ad27b4fd23a1",
      "url": "https://www.semanticscholar.org/paper/b65358d41ed4f6a06df8d0f89344ad27b4fd23a1",
      "title": "ff-bifbox: A scalable, open-source toolbox for bifurcation analysis of nonlinear PDEs",
      "openAccessPdf": {
        "url": "",
        "status": null,
        "license": null,
        "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2509.18429, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
      },
      "publicationDate": "2025-09-22",
      "authors": [
        {
          "authorId": "2381734903",
          "name": "Christopher M. Douglas"
        },
        {
          "authorId": "2315587080",
          "name": "Pierre Jolivet"
        }
      ],
      "abstract": "Nonlinear PDEs give rise to complex dynamics that are often difficult to analyze in state space due to their relatively large numbers of degrees of freedom, ill-conditioned operators, and changing spatial and parameter resolution requirements. This work introduces ff-bifbox: a new open-source toolbox for performing numerical branch tracing, stability/bifurcation analysis, resolvent analysis, and time integration of large, time-dependent nonlinear PDEs discretized on adaptively refined meshes in two and three spatial dimensions. Spatial discretization is handled using finite elements in FreeFEM, with the discretized operators manipulated in a distributed framework via PETSc. Following a summary of the underlying theory and numerics, results from three examples are presented to validate the implementation and demonstrate its capabilities. The considered examples, which are provided with runnable ff-bifbox code, include: a 3-D Brusselator system, a 3-D plate buckling system, and a 2-D compressible Navier--Stokes system. In addition to reproducing results from prior studies, novel results are presented for each system."
    },
    {
      "paperId": "4560a01f24998bf47db0e29d3748dc2c28e84522",
      "url": "https://www.semanticscholar.org/paper/4560a01f24998bf47db0e29d3748dc2c28e84522",
      "title": "MULTISCALE IN SILICO MODELS OF FRACTURE HEALING: PROVIDING AN INTEGRATIVE FRAMEWORK TO UNDERSTAND THE INFLUENCES OF DEFECT SIZE, SEX DIFFERENCES, AND INFLAMMATION",
      "openAccessPdf": {
        "url": "",
        "status": null,
        "license": null,
        "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1302/1358-992x.2025.7.097?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1302/1358-992x.2025.7.097, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
      },
      "publicationDate": "2025-09-15",
      "authors": [
        {
          "authorId": "1734968757",
          "name": "Laura Lafuente-Gracia"
        },
        {
          "authorId": "34687120",
          "name": "Mojtaba Barzegari"
        },
        {
          "authorId": "47751347",
          "name": "A. Carlier"
        },
        {
          "authorId": "2624344",
          "name": "L. Geris"
        }
      ],
      "abstract": "Bone healing is a well-coordinated process involving numerous biological entities. While successful healing typically occurs within weeks, fracture severity, anatomical location and host factors can lead to delayed or non-healing. Critical-size defects require intervention to promote healing, with healing depending on the defect's location and its surroundings. Among host factors, the role of sex differences remains poorly understood, as most preclinical research has focused primarily on male subjects. Consequently, treatments may affect men and women differently. The use of (sex-specific) in silico models offers an interesting methodology to investigate the biological mechanisms underlying fracture healing and the influences of external factors, as well as to propose patient-specific treatment strategies.Following existing bioregulatory models we developed multiscale in silico models of bone healing to investigate normal and impaired sex-specific healing in long bone, mandibular and calvarial defects. These geometries were derived from in vivo experimental set-ups in rabbits and rodents. Our in silico models describe the spatiotemporal evolution of biochemical factors, cells and tissues, from the early inflammatory response to hard callus formation, incorporating sprouting angiogenesis with lateral inhibition of endothelial cells via Dll4-Notch1 signaling. The models were parameterized with sex-specific values informed by literature, focusing on young males and females of reproductive age. Finally, we explored the influence of a scaffold produced by melt electrowriting (MEW), coated (or not) with cells and/or growth factors (GF) as a treatment strategy. The models were implemented in MATLAB and FreeFEM and validated against in vivo data from the literature and in-house experiments.For normal healing in long bone defects, our model predicted a stronger inflammatory response in females and a stronger repair response in males, in alignment with literature data (results not shown). The predicted healing outcomes were similar between both sexes, matching experimental observations both qualitatively and quantitatively. For critical-sized craniofacial defects, our in silico predictions of a non-union matched the in vivo results at 4 and 12 weeks. We used our models to investigate adequate GF concentrations to load onto the MEW scaffold to achieve (delayed) healing.In summary, our in silico models predict realistic healing patterns that align with experimentally observed behavior, enhancing our understanding of bone defect healing mechanisms under different conditions, a first step towards the implementation of patient-specific in silico models of bone regeneration."
    },
    {
      "paperId": "cf9ac8201830adb97390c4ff558c160eada055b3",
      "url": "https://www.semanticscholar.org/paper/cf9ac8201830adb97390c4ff558c160eada055b3",
      "title": "Some stochastic process techniques applied to deterministic models",
      "openAccessPdf": {
        "url": "",
        "status": null,
        "license": null,
        "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2508.02700, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
      },
      "publicationDate": "2025-07-28",
      "authors": [
        {
          "authorId": "2369403541",
          "name": "E. J. 'Avila-Vales"
        },
        {
          "authorId": "1402940621",
          "name": "J. Villa‐Morales"
        }
      ],
      "abstract": "Stochastic mathematical models are essential tools for understanding and predicting complex phenomena. The purpose of this work is to study the exit times of a stochastic dynamical system-specifically, the mean exit time and the distribution of exit times of the stochastic process within a bounded domain. These quantities are obtained by solving elliptic and parabolic partial differential equations (PDEs), respectively. To support practical applications, we propose a numerical scheme implemented in FreeFEM, emphasizing its effectiveness in two- and three-dimensional cases due to the software's limitations in higher dimensions. The examples provided illustrate the theoretical results, which extend known one-dimensional solutions to higher-dimensional settings. This contribution bridges theoretical and computational approaches for analyzing stochastic processes in multidimensional domains, offering insights into their behavior and potential applications."
    },
    {
      "paperId": "9e9ba1d14142f8ad7e19106a5ee2ef37529b8fb8",
      "url": "https://www.semanticscholar.org/paper/9e9ba1d14142f8ad7e19106a5ee2ef37529b8fb8",
      "title": "A Novel 3-D-Printed Passive Microfluidic Temperature Sensor for Medical Applications",
      "openAccessPdf": {
        "url": "",
        "status": "CLOSED",
        "license": null,
        "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1109/TCPMT.2025.3552029?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1109/TCPMT.2025.3552029, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
      },
      "publicationDate": "2025-07-01",
      "authors": [
        {
          "authorId": "2313961724",
          "name": "Issam El Gmati"
        },
        {
          "authorId": "2350749038",
          "name": "Yosra Gmati"
        },
        {
          "authorId": "2050409230",
          "name": "W. Amara"
        },
        {
          "authorId": "2326494054",
          "name": "Ridha Ghayoula"
        },
        {
          "authorId": "2666070",
          "name": "A. Smida"
        },
        {
          "authorId": "2115155840",
          "name": "Mohammed Waly"
        },
        {
          "authorId": "2209717906",
          "name": "J. Fattahi"
        },
        {
          "authorId": "2350749051",
          "name": "Jamil Satouri"
        }
      ],
      "abstract": "The electrical response of a novel passive 3-D-printed temperature sensor could significantly broaden its scope of applications and enhance the integration of microelectro-mechanical system (MEMS) microfluidic-based laboratory-on-a-chip (LOC) technologies. This article introduces an innovative temperature sensor based on the microfluidic technology which is well-suited for medical applications. The sensor’s design and optimization were conducted using multiphysics modeling and finite element method (FEM) simulations, implemented through FreeFEM++ software. Samples were produced using stereolithographic 3-D printing. A metal carrier was constructed to secure the chips during tank heating and the flow visualization with a microscope. X-ray microtomography tests were performed on chips to compare real parts with CAD models. Filling tests were conducted to position the liquid within the microfluidic channel. Furthermore, several types of liquids were tested, and contact angle (CA) measurements were employed to characterize the microfluidic chip’s structural material (DS3000) and various liquids, aiding in discerning the dielectric liquid were applied also. Among the liquids tested, water emerged as the most promising for this type of temperature sensor. Volume expansion calculations for different temperature values were performed, revealing a measured linear thermal expansion exceeding <inline-formula> <tex-math notation=\"LaTeX\">$40~\\mu $ </tex-math></inline-formula>m/°C within the range of <inline-formula> <tex-math notation=\"LaTeX\">$20~^{\\circ }$ </tex-math></inline-formula>C–<inline-formula> <tex-math notation=\"LaTeX\">$55~^{\\circ }$ </tex-math></inline-formula>C. This study paves the way for microfluidic devices capable of measuring low flow rates using a temperature effect, thereby providing access to 16 an electrical response."
    }
  ]
}