{
  "articles": [
    {
      "paperId": "22886d302d3129bccda8bff5017d6d45f235a119",
      "url": "https://www.semanticscholar.org/paper/22886d302d3129bccda8bff5017d6d45f235a119",
      "title": "Magnetohydrodynamic mixed convection of nanofluid flow in a split lid driven cavity using finite element method",
      "abstract": "A computational study on the effect of magnetohydrodynamic mixed convection of nanofluid flow in a square split lid driven cavity with a block placed near the bottom wall is undertaken. Two different nanoparticles gold and alumina are considered for the study. The observations for the study are obtained by solving the non-dimensionalized governing equations by Finite Element Method with variational approach as accessible with the FreeFEM++ software. The results for different Prandtl numbers ( Pr), Richardson number ( Ri), volume fractions of nanoparticles [Formula: see text], Reynolds number (Re), and MHD parameters (M) are displayed through graphs and figures. It has been observed that the pressure distribution significantly increases with the increment in Reynolds number but both the nanoparticles behave differently. The magnetic field enhancement ( M = 0.1, 0.2, 0.5 and 0.9) decreases the velocity within the cavity. The convective heat transfer is faster in the case of Reynolds number ( Re) = 100 than in the case of Reynolds number ( Re) = 14 or 21. And also increasing the Richardson Number from 0.1 to 1.0, the average Nusselt number shows increment of ∼9.5% and with Ri = 1.0 to 10.0, an increment of ∼3% whereas decrement with higher Reynolds Number ( Re = 21, 100) for Gold and Allumina nanoparticles respectively. The present simulations have various applications for the study of natural phenomenon like climate control, meteorological and geophysical activities and industrial applications like cooling of electronics equipment, heat exchanger.",
      "publicationDate": "2024-11-01",
      "authors": [
        {
          "authorId": "2328885832",
          "name": "Ankita Dubey"
        },
        {
          "authorId": "107661296",
          "name": "B. Vasu"
        },
        {
          "authorId": "120900935",
          "name": "R. Gorla"
        },
        {
          "authorId": "1396899249",
          "name": "M. H. Borbora"
        },
        {
          "authorId": "2295382025",
          "name": "A. Chamkha"
        }
      ]
    },
    {
      "paperId": "19ff5f8bbe918595619d225199514e9fec340c44",
      "url": "https://www.semanticscholar.org/paper/19ff5f8bbe918595619d225199514e9fec340c44",
      "title": "Optimal Control of a Domestic Frost-Free Refrigerator Inlet Freezer from the Perspective of Reducing Energy Consumption",
      "abstract": "This study is dedicated to the development of a mathematical model based on shape optimal control of the inlet domestic frost-free refrigerator in the context of energy consumption reduction. A three-dimensional thermofluid model is established for the numerical studies. As the physical system (with shelves and fruits) can be seen as a porous medium, the coupled state equations of the transport mechanism (for velocity and temperature fields) are governed by Navier–Stokes–Forchheimer/Fourier equations. Then, based on the finite element method, the numerical scheme computation is made with FreeFem++ software (Version 4.6). Numerical results are shown for three different cases: empty without shelves, empty with shelves, and loaded with foods. For each case, the velocity and temperature fields’ results are discussed for the optimal configurations. The characterization of these physical parameters would help engineers in domestic frost-free refrigerator design.",
      "publicationDate": "2024-10-22",
      "authors": [
        {
          "authorId": "2268151043",
          "name": "Nacer Sellila"
        },
        {
          "authorId": "2268152057",
          "name": "Waleed Mouhali"
        },
        {
          "authorId": "92921711",
          "name": "M. Louaked"
        },
        {
          "authorId": "2903234",
          "name": "Houari Mechkour"
        }
      ]
    },
    {
      "paperId": "0757ef59989e6718333f4128b84fae2a6310120e",
      "url": "https://www.semanticscholar.org/paper/0757ef59989e6718333f4128b84fae2a6310120e",
      "title": "Simulação da Dinâmica Populacional do Mexilhão-Dourado Utilizando o Método dos Elementos Finitos via FreeFem",
      "abstract": "Este artigo apresenta uma aplicação do método dos elementos finitos, via o software FreeFem, para resolver um modelo matemático que simula a dinâmica populacional do mexilhão-dourado, suas larvas e as algas. O modelo considera a relação predador-presa e os parâmetros físicos que influenciam o comportamento dessas espécies. A simulação, realizada em diferentes domínios, permite visualizar a concentração do mexilhão-dourado após um ano de experimento. O objetivo é compreender como diferentes condições ambientais afetam a propagação dessa espécie exótica, que é uma praga no Brasil, e assim contribuir para o desenvolvimento de estratégias de controle mais eficazes e menos onerosas.",
      "publicationDate": "2024-10-17",
      "authors": [
        {
          "authorId": "2333489143",
          "name": "Edgard S. Theotonio"
        },
        {
          "authorId": "2333487575",
          "name": "Ramoni Z. Sedano Azevedo"
        },
        {
          "authorId": "2093005249",
          "name": "L. Catabriga"
        }
      ]
    },
    {
      "paperId": "f0e89a7a55852a2ac678d3ab80c3a36953e61bb6",
      "url": "https://www.semanticscholar.org/paper/f0e89a7a55852a2ac678d3ab80c3a36953e61bb6",
      "title": "Far-field sound field estimation using robotized measurements and the boundary elements method",
      "abstract": "Sound Field Estimation (SFE) is a numerical technique widely used to identify and reconstruct the acoustic fields radiated by unknown structures. In particular, SFE proves to be useful when data is only available close to the source, but information in the whole space is required. However,\n the practical implementation of this method is still hindered by two major drawbacks: the lack of efficient implementation of existing numerical methodologies, and the time-consuming and tedious roll-out of acoustic measurements. This paper aims to provide a solution to both issues. First,\n the measurements step is fully automated by using a robotic arm, able to accurately gather geometric and acoustic data without any human assistance. In this matter, a particular attention has been paid to the impact of the robot on the acoustic pressure measurements. The sound field prediction\n is then tackled using the Boundary Element Method (BEM), and implemented using the FreeFEM++ BEM library. Numerically simulated measurements have allowed us to assess the method accuracy, and the overall solution has been successfully tested using actual robotized measurements of an unknown\n loudspeaker.",
      "publicationDate": "2024-10-04",
      "authors": [
        {
          "authorId": "2273981648",
          "name": "Caroline Pascal"
        },
        {
          "authorId": "2325272834",
          "name": "Pierre Marchand"
        },
        {
          "authorId": "2274002942",
          "name": "Alexandre Chapoutot"
        },
        {
          "authorId": "2273983195",
          "name": "Olivier Doaré"
        }
      ]
    },
    {
      "paperId": "35b39f7f0aa82a86f348659b17220113a46da9da",
      "url": "https://www.semanticscholar.org/paper/35b39f7f0aa82a86f348659b17220113a46da9da",
      "title": "Investigation of the Output Voltage of a Piezoresistive MEMS Pressure Sensor Using Finite Element Modelling",
      "abstract": "In this paper, based on a 3D finite element model of a piezoresistive MEMS pressure sensor developed previously using FreeFem++, the output voltage of the device is calculated via three approaches. In the first approach, the output voltage is calculated using the widely used empirical formula for the Wheatstone bridge circuits, and thus, it is called the empirical result. In the second approach, firstly, the mean stresses are obtained within the four P-type resistors and the resistivity of the resistors is calculated using the constitutive relation of piezoresistivity. Then a steady state equation of the electric potential is solved and the electric potentials are extracted at the corner of the Cu interconnects. Thus, their difference yields the output voltage and it is called the semi-empirical result. However, within the resistors, the distribution of stresses are in fact quite inhomogeneous and thus their resistivity is also inhomogeneous. Hence, in the third approach, the resistivity of the four resistors are determined as functions of the stresses within the resistors using the constitutive relation of piezoresistivity. Then the electrical potential is also obtained numerically and the output voltages are extracted. The result obtained using the third approach is thus called the numerical result, which is the accurate output voltage of the pressure sensor determined numerically. During the simulations, the influences of different thicknesses of the silicon diaphragm, different widths of the P-type silicon resistor, and different distances between the center of the diaphragm and the midpoint of the P-type silicon resistor, are studied. The three results mentioned above are compared. Simulations show that the three results qualitatively agree with each other with the output voltage from the third approach being 30% higher. We argue, though the widely used empirical result leads to a less accurate output voltage, but it can still achieve the purpose of aiding the design of a piezoresistive MEMS pressure sensor satisfactorily.",
      "publicationDate": "2024-08-07",
      "authors": [
        {
          "authorId": "2322714126",
          "name": "Yuqing Xia"
        },
        {
          "authorId": "2296559637",
          "name": "Peng Zhou"
        },
        {
          "authorId": "2322825870",
          "name": "Chunming Zhou"
        },
        {
          "authorId": "2322541290",
          "name": "Yubao Zhen"
        },
        {
          "authorId": "2296674876",
          "name": "Xiyao Du"
        }
      ]
    },
    {
      "paperId": "d18c2126978909bd89db9b1d36c2f7b1515ffe4c",
      "url": "https://www.semanticscholar.org/paper/d18c2126978909bd89db9b1d36c2f7b1515ffe4c",
      "title": "AutoFreeFem: Automatic code generation with FreeFEM++ and LaTex output for shape and topology optimization of non-linear multi-physics problems",
      "abstract": "For an educational purpose we develop the Python package AutoFreeFem which generates all ingredients for shape optimization with non-linear multi-physics in FreeFEM++ and also outputs the expressions for use in LaTex. As an input, the objective function and the weak form of the problem have to be specified only once. This ensures consistency between the simulation code and its documentation. In particular, AutoFreeFem provides the linearization of the state equation, the adjoint problem, the shape derivative, as well as a basic implementation of the level-set based mesh evolution method for shape optimization. For the computation of shape derivatives we utilize the mathematical Lagrangian approach for differentiating PDE-constrained shape functions. Differentiation is done symbolically using Sympy. In numerical experiments we verify the accuracy of the computed derivatives. Finally, we showcase the capabilities of AutoFreeFem by considering shape optimization of a non-linear diffusion problem, linear and non-linear elasticity problems, a thermo-elasticity problem and a fluid-structure interaction problem.",
      "publicationDate": "2024-07-16",
      "authors": [
        {
          "authorId": "2311509195",
          "name": "Gr'egoire Allaire"
        },
        {
          "authorId": "51257846",
          "name": "M. Gfrerer"
        }
      ]
    },
    {
      "paperId": "7081de83579b919cf91181d99796dd1355bfb9d3",
      "url": "https://www.semanticscholar.org/paper/7081de83579b919cf91181d99796dd1355bfb9d3",
      "title": "A Domain Decomposition Finite Element Method for the Magneto-Thermal Field Analysis of Electric Machines",
      "abstract": "In this paper, a domain decomposition finite element method is proposed for the magneto-thermal field analysis of electric machines. 2-D and 3-D numerical models are built for the magnetic field and thermal field of electric machines, respectively. The computational domains of these two fields are decomposed into subdomains based on the discretized meshes to balance the computation work between processors. With the decomposed subdomains, the additive Schwarz method is developed to solve the forming numerical problems of these two fields using the open source platform freefem++, and a significant improvement in efficiency can be observed from the numerical results of single field analysis of a permanent magnet synchronous machine (PMSM). The coupling between these two fields is modelled with the electromagnetic losses and temperature dependent properties, and a two-step searching algorithm is developed for the data mapping between field solvers, which employ different dimensional models and inconsistent meshes. The counterpart subdomain is determined before searching the counterpart element to reduce the computation effort of searching. The magneto-thermal field analysis of the studied PMSM is finally conducted with the proposed method to showcase its effectiveness.",
      "publicationDate": "2024-06-02",
      "authors": [
        {
          "authorId": "2145041466",
          "name": "Yunpeng Zhang"
        },
        {
          "authorId": "2312000241",
          "name": "Jinpeng Cheng"
        },
        {
          "authorId": "91440392",
          "name": "Xinsheng Yang"
        },
        {
          "authorId": "2311851116",
          "name": "Qibin Zhou"
        },
        {
          "authorId": "2311713881",
          "name": "Weinong Fu"
        }
      ]
    },
    {
      "paperId": "7a35912dcbea1b4e2ea83b3979470ca34dba1c48",
      "url": "https://www.semanticscholar.org/paper/7a35912dcbea1b4e2ea83b3979470ca34dba1c48",
      "title": "МІКРОСЕРВІСНА АРХІТЕКТУРА СИСТЕМ СКІНЧЕННО-ЕЛЕМЕНТНОГО АНАЛІЗУ",
      "abstract": "У світі швидкого технологічного розвитку ефективність і гнучкість архітектур програмної інженерії відіграють ключову роль у створенні масштабованих і відмовостійких систем. Це набуває критичного значення для систем скінченно-елементного аналізу (FEA-систем), які використовуються для моделювання складних фізичних процесів в інженерії та часто повинні обробляти великі обсяги даних. Більшість сучасних FEA-систем використовують монолітну архітектуру – традиційну модель із єдиною кодовою базою для виконання різних функцій. Такий підхід має переваги, такі як єдине середовище розробки та легше налагодження взаємодії компонентів, і суттєві недоліки: складність масштабування, низьку відмовостійкість, погане балансування навантаження, зростання часу відповіді при збільшенні обсягів даних і складність впровадження нових функцій/технологій. Одним із можливих рішень є концепція мікросервісної архітектури, яка передбачає розбиття програмного забезпечення на невеликі незалежні компоненти (сервіси). Кожен сервіс виконує одну функцію і взаємодіє з іншими через чітко визначені інтерфейси. Оскільки вони працюють незалежно, їх можна оновлювати, змінювати, розгортати або масштабувати окремо. Це надає низку переваг: швидке розгортання, незалежність сервісів, гнучке окреме масштабування, стійкість до збоїв, технологічну гнучкість, кращу організацію та простоту тестування, переваги у хмарних середовищах. У статті порівнюються монолітні (Elmer FEM, FreeFEM), мікросервісні (SimScale) і хмарно-монолітні (ANSYS Cloud) FEA- системи за критеріями архітектури, масштабованості, відмовостійкості, розгортання та модифікації. Обґрунтовується перевага мікросервісного підходу та пропонується архітектура FEA-системи на основі патернів API Gateway, Aggregator, Database per Service, Event-Driven, Publisher/ Subscriber, Backend for Frontend.",
      "publicationDate": "2024-05-30",
      "authors": [
        {
          "authorId": "2304125705",
          "name": "Я. В. Кривий"
        },
        {
          "authorId": "2228086163",
          "name": "Антон Лісняк"
        }
      ]
    },
    {
      "paperId": "ea6ac9526d7f4981ac9fb2dbdbac5808558b4959",
      "url": "https://www.semanticscholar.org/paper/ea6ac9526d7f4981ac9fb2dbdbac5808558b4959",
      "title": "Accurate 3D modeling of laser-matter interaction in the AFP process by a conductive-radiative FEM approach",
      "abstract": "Abstract. Mainly driven by aeronautical demands, the Automated Fiber Placement (AFP) process has become pivotal in the in-situ manufacturing of intricate, high-performance composite components. AFP relies on robotic systems to meticulously lay continuous fiber-reinforced materials, employing controlled pressure and precise laser heating. Accurate thermal modeling is imperative to predict thermal effects impacting contact, adhesion, crystallinity, and residual constraints. This work introduces a novel numerical approach for efficient modeling the transient heat transfers in the AFP process using a coupled conductive-radiative finite element method (FEM) scheme. Radiative density from the laser-matter interaction is determined through an in-house parallelized FreeFEM++ code. Heat transfer at the micro-scale is assessed by using an artificial computational geometry based on fiber distributions obtained from tape micrograph. A parametric study with varying absorption coefficients of the carbon fibers is performed to accurately compute the radiative volumetric heat source. The proposed approach investigates various 2D and 3D scenarios involving different laser parameters. Results exhibit strong agreement with experimentally obtained data, showing a maximum temperature difference of 5-6°C at the end of the heating phase. Furthermore, a 3D case demonstrates the potential of this approach for modeling complex micro-scale geometries.",
      "publicationDate": "2024-05-15",
      "authors": [
        {
          "authorId": "2263528291",
          "name": "Bruno A. Storti"
        }
      ]
    },
    {
      "paperId": "b728dacd0b8bf96c8a346ab686b3e63f38c8dd98",
      "url": "https://www.semanticscholar.org/paper/b728dacd0b8bf96c8a346ab686b3e63f38c8dd98",
      "title": "Topology optimization of three-dimensional structures subject to self-weight loading",
      "abstract": "PurposeTopology optimization of structures under self-weight loading is a challenging problem which has received increasing attention in the past years. The use of standard formulations based on compliance minimization under volume constraint suffers from numerous difficulties for self-weight dominant scenarios, such as non-monotonic behaviour of the compliance, possible unconstrained character of the optimum and parasitic effects for low densities in density-based approaches. This paper aims to propose an alternative approach for dealing with topology design optimization of structures into three spatial dimensions subject to self-weight loading.Design/methodology/approachIn order to overcome the above first two issues, a regularized formulation of the classical compliance minimization problem under volume constraint is adopted, which enjoys two important features: (a) it allows for imposing any feasible volume constraint and (b) the standard (original) formulation is recovered once the regularizing parameter vanishes. The resulting topology optimization problem is solved with the help of the topological derivative method, which naturally overcomes the above last issue since no intermediate densities (grey-scale) approach is necessary.FindingsA novel and simple approach for dealing with topology design optimization of structures into three spatial dimensions subject to self-weight loading is proposed. A set of benchmark examples is presented, showing not only the effectiveness of the proposed approach but also highlighting the role of the self-weight loading in the final design, which are: (1) a bridge structure is subject to pure self-weight loading; (2) a truss-like structure is submitted to an external horizontal force (free of self-weight loading) and also to the combination of self-weight and the external horizontal loading; and (3) a tower structure is under dominant self-weight loading.Originality/valueAn alternative regularized formulation of the compliance minimization problem that naturally overcomes the difficulties of dealing with self-weight dominant scenarios; a rigorous derivation of the associated topological derivative; computational aspects of a simple FreeFEM implementation; and three-dimensional numerical benchmarks of bridge, truss-like and tower structures.",
      "publicationDate": "2024-04-02",
      "authors": [
        {
          "authorId": "2294492923",
          "name": "Jorge Morvan Marotte Luz Filho"
        },
        {
          "authorId": "2294493603",
          "name": "Antonio Andre Novotny"
        }
      ]
    }
  ]
}