{
  "articles": [
    {
      "paperId": "4560a01f24998bf47db0e29d3748dc2c28e84522",
      "url": "https://www.semanticscholar.org/paper/4560a01f24998bf47db0e29d3748dc2c28e84522",
      "title": "MULTISCALE IN SILICO MODELS OF FRACTURE HEALING: PROVIDING AN INTEGRATIVE FRAMEWORK TO UNDERSTAND THE INFLUENCES OF DEFECT SIZE, SEX DIFFERENCES, AND INFLAMMATION",
      "openAccessPdf": {
        "url": "",
        "status": null,
        "license": null,
        "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1302/1358-992x.2025.7.097?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1302/1358-992x.2025.7.097, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
      },
      "publicationDate": "2025-09-15",
      "authors": [
        {
          "authorId": "1734968757",
          "name": "Laura Lafuente-Gracia"
        },
        {
          "authorId": "34687120",
          "name": "Mojtaba Barzegari"
        },
        {
          "authorId": "47751347",
          "name": "A. Carlier"
        },
        {
          "authorId": "2624344",
          "name": "L. Geris"
        }
      ],
      "abstract": "Bone healing is a well-coordinated process involving numerous biological entities. While successful healing typically occurs within weeks, fracture severity, anatomical location and host factors can lead to delayed or non-healing. Critical-size defects require intervention to promote healing, with healing depending on the defect's location and its surroundings. Among host factors, the role of sex differences remains poorly understood, as most preclinical research has focused primarily on male subjects. Consequently, treatments may affect men and women differently. The use of (sex-specific) in silico models offers an interesting methodology to investigate the biological mechanisms underlying fracture healing and the influences of external factors, as well as to propose patient-specific treatment strategies.Following existing bioregulatory models we developed multiscale in silico models of bone healing to investigate normal and impaired sex-specific healing in long bone, mandibular and calvarial defects. These geometries were derived from in vivo experimental set-ups in rabbits and rodents. Our in silico models describe the spatiotemporal evolution of biochemical factors, cells and tissues, from the early inflammatory response to hard callus formation, incorporating sprouting angiogenesis with lateral inhibition of endothelial cells via Dll4-Notch1 signaling. The models were parameterized with sex-specific values informed by literature, focusing on young males and females of reproductive age. Finally, we explored the influence of a scaffold produced by melt electrowriting (MEW), coated (or not) with cells and/or growth factors (GF) as a treatment strategy. The models were implemented in MATLAB and FreeFEM and validated against in vivo data from the literature and in-house experiments.For normal healing in long bone defects, our model predicted a stronger inflammatory response in females and a stronger repair response in males, in alignment with literature data (results not shown). The predicted healing outcomes were similar between both sexes, matching experimental observations both qualitatively and quantitatively. For critical-sized craniofacial defects, our in silico predictions of a non-union matched the in vivo results at 4 and 12 weeks. We used our models to investigate adequate GF concentrations to load onto the MEW scaffold to achieve (delayed) healing.In summary, our in silico models predict realistic healing patterns that align with experimentally observed behavior, enhancing our understanding of bone defect healing mechanisms under different conditions, a first step towards the implementation of patient-specific in silico models of bone regeneration."
    },
    {
      "paperId": "96927b16c97a6965904e6361b2f5682641a385f0",
      "url": "https://www.semanticscholar.org/paper/96927b16c97a6965904e6361b2f5682641a385f0",
      "title": "Assessment of the Runaway Electrons induced damage to the Tokamak First Wall",
      "openAccessPdf": {
        "url": "",
        "status": null,
        "license": null,
        "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2508.20502, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
      },
      "publicationDate": "2025-08-28",
      "authors": [
        {
          "authorId": "2360491435",
          "name": "L. Singh"
        },
        {
          "authorId": "2208918184",
          "name": "M. D. Bastiani"
        },
        {
          "authorId": "2377795900",
          "name": "R. Bonifetto"
        },
        {
          "authorId": "144944441",
          "name": "F. Subba"
        },
        {
          "authorId": "2277212525",
          "name": "D. Borgogno"
        }
      ],
      "abstract": "The study assessed the damage caused by Runaway Electrons (RE) on First Wall tiles, comparing the effects on Beryllium and Tungsten. This was done by using realistic RE energy distribution functions to replicate RE impacts through the FLUKA code. These energy distribution functions are based on the ASDEX Upgrade experiment # 39012. The parametric analysis carried out with FLUKA in the presence of magnetic fields indicated a clear relationship between the beam impact angle and the material deposited energy, demonstrating that higher impact angles lead to deeper electron penetration and greater deposited energies. A finite element model based on apparent heat capacity formulation in FreeFem++ was developed to analyze the material thermal response to such thermal loads using volumetric energy density profiles from FLUKA simulations as input. Different RE current values were simulated to show its influence on the evolution of the material temperature and melting thickness"
    },
    {
      "paperId": "cf9ac8201830adb97390c4ff558c160eada055b3",
      "url": "https://www.semanticscholar.org/paper/cf9ac8201830adb97390c4ff558c160eada055b3",
      "title": "Some stochastic process techniques applied to deterministic models",
      "openAccessPdf": {
        "url": "",
        "status": null,
        "license": null,
        "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2508.02700, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
      },
      "publicationDate": "2025-07-28",
      "authors": [
        {
          "authorId": "2369403541",
          "name": "E. J. 'Avila-Vales"
        },
        {
          "authorId": "1402940621",
          "name": "J. Villa‐Morales"
        }
      ],
      "abstract": "Stochastic mathematical models are essential tools for understanding and predicting complex phenomena. The purpose of this work is to study the exit times of a stochastic dynamical system-specifically, the mean exit time and the distribution of exit times of the stochastic process within a bounded domain. These quantities are obtained by solving elliptic and parabolic partial differential equations (PDEs), respectively. To support practical applications, we propose a numerical scheme implemented in FreeFEM, emphasizing its effectiveness in two- and three-dimensional cases due to the software's limitations in higher dimensions. The examples provided illustrate the theoretical results, which extend known one-dimensional solutions to higher-dimensional settings. This contribution bridges theoretical and computational approaches for analyzing stochastic processes in multidimensional domains, offering insights into their behavior and potential applications."
    },
    {
      "paperId": "9e9ba1d14142f8ad7e19106a5ee2ef37529b8fb8",
      "url": "https://www.semanticscholar.org/paper/9e9ba1d14142f8ad7e19106a5ee2ef37529b8fb8",
      "title": "A Novel 3-D-Printed Passive Microfluidic Temperature Sensor for Medical Applications",
      "openAccessPdf": {
        "url": "",
        "status": "CLOSED",
        "license": null,
        "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1109/TCPMT.2025.3552029?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1109/TCPMT.2025.3552029, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
      },
      "publicationDate": "2025-07-01",
      "authors": [
        {
          "authorId": "2313961724",
          "name": "Issam El Gmati"
        },
        {
          "authorId": "2350749038",
          "name": "Yosra Gmati"
        },
        {
          "authorId": "2050409230",
          "name": "W. Amara"
        },
        {
          "authorId": "2326494054",
          "name": "Ridha Ghayoula"
        },
        {
          "authorId": "2666070",
          "name": "A. Smida"
        },
        {
          "authorId": "2115155840",
          "name": "Mohammed Waly"
        },
        {
          "authorId": "2209717906",
          "name": "J. Fattahi"
        },
        {
          "authorId": "2350749051",
          "name": "Jamil Satouri"
        }
      ],
      "abstract": "The electrical response of a novel passive 3-D-printed temperature sensor could significantly broaden its scope of applications and enhance the integration of microelectro-mechanical system (MEMS) microfluidic-based laboratory-on-a-chip (LOC) technologies. This article introduces an innovative temperature sensor based on the microfluidic technology which is well-suited for medical applications. The sensor’s design and optimization were conducted using multiphysics modeling and finite element method (FEM) simulations, implemented through FreeFEM++ software. Samples were produced using stereolithographic 3-D printing. A metal carrier was constructed to secure the chips during tank heating and the flow visualization with a microscope. X-ray microtomography tests were performed on chips to compare real parts with CAD models. Filling tests were conducted to position the liquid within the microfluidic channel. Furthermore, several types of liquids were tested, and contact angle (CA) measurements were employed to characterize the microfluidic chip’s structural material (DS3000) and various liquids, aiding in discerning the dielectric liquid were applied also. Among the liquids tested, water emerged as the most promising for this type of temperature sensor. Volume expansion calculations for different temperature values were performed, revealing a measured linear thermal expansion exceeding <inline-formula> <tex-math notation=\"LaTeX\">$40~\\mu $ </tex-math></inline-formula>m/°C within the range of <inline-formula> <tex-math notation=\"LaTeX\">$20~^{\\circ }$ </tex-math></inline-formula>C–<inline-formula> <tex-math notation=\"LaTeX\">$55~^{\\circ }$ </tex-math></inline-formula>C. This study paves the way for microfluidic devices capable of measuring low flow rates using a temperature effect, thereby providing access to 16 an electrical response."
    },
    {
      "paperId": "05c5891e3826255e3d563e82d4acd3974b031d6f",
      "url": "https://www.semanticscholar.org/paper/05c5891e3826255e3d563e82d4acd3974b031d6f",
      "title": "A Level Set Topology Optimization Theory Based on Hamilton's Principle",
      "openAccessPdf": {
        "url": "",
        "status": null,
        "license": null,
        "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2504.14892, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
      },
      "publicationDate": "2025-04-21",
      "authors": [
        {
          "authorId": "2356547558",
          "name": "Jan Oellerich"
        },
        {
          "authorId": "2244299499",
          "name": "T. Yamada"
        }
      ],
      "abstract": "In this article, we propose a unified variational framework for deriving the evolution equation of the level set function in topology optimization, departing from conventional Hamilton–Jacobi‐based formulations. The key idea is the introduction of an auxiliary domain, geometrically identical to the physical design domain, occupied by fictitious matter which is dynamically excited by the conditions prevailing in the design domain. By assigning kinetic and potential energy to this matter and interpreting the level set function as the generalized coordinate to describe its deformation, the governing equation of motion is determined via Hamilton's principle, yielding a modified wave equation. Appropriate combinations of model parameters enable the recovery of classical physical behaviors, including the standard and biharmonic wave equations. The evolution problem is formulated in weak form using variational methods and implemented in the software environment FreeFEM++. The influence of the numerical parameters is analyzed on the example of minimum mean compliance. The results demonstrate that topological complexity and strut design can be effectively controlled by the respective parameters. Notably, the proposed formulation inherently supports the nucleation of new holes and maintains a well‐defined level set function without requiring explicit re‐initialization procedures, both of which emerge naturally from the physically motivated variational framework. The inclusion of a damping term further enhances numerical stability. To showcase the versatility and robustness of our method, we also apply it to compliant mechanism design and a bi‐objective optimization problem involving self‐weight and compliance minimization under local stress constraints."
    },
    {
      "paperId": "7b008b2138f85d2ce0fecd1b56befedfbb5e88df",
      "url": "https://www.semanticscholar.org/paper/7b008b2138f85d2ce0fecd1b56befedfbb5e88df",
      "title": "Controle ótimo em equações de ondas via equilíbrios de Nash e Pareto",
      "openAccessPdf": {
        "url": "",
        "status": null,
        "license": null,
        "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.5269/bspm.68317?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.5269/bspm.68317, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
      },
      "publicationDate": "2025-02-22",
      "authors": [
        {
          "authorId": "2056810155",
          "name": "Pitágoras Pinheiro de Carvalho"
        },
        {
          "authorId": "2351960785",
          "name": "Gildenia R. Sousa-Neto"
        }
      ],
      "abstract": "The objective of this work is to making a theoretical and numerical study on bi-objective optimal control for the linear and semi-linear wave equations, via Nash and Pareto equilibrium strategies, in three-dimensional domains. Due to being related to an optimization process, we will use cost functional minimization, formulated in combination with some strategies related to Nash Equilibrium and Pareto Equilibrium. We will use the FreeFem++ software to transcribe the theoretical problems to the C++ programming language, describing the spatial discretization data through the Finite Element Method (FEM), and the discretization of its temporal evolution, with the Finite Difference Method."
    },
    {
      "paperId": "b230d3cbf5532181594da88da6b4df923653e85b",
      "url": "https://www.semanticscholar.org/paper/b230d3cbf5532181594da88da6b4df923653e85b",
      "title": "Modelling Phase Change Material Solidification/Melting for Accurate Thermal Energy Storage Design in Refrigeration Applications",
      "openAccessPdf": {
        "url": "https://doi.org/10.1088/1742-6596/2940/1/012009",
        "status": "GOLD",
        "license": null,
        "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1088/1742-6596/2940/1/012009?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1088/1742-6596/2940/1/012009, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
      },
      "publicationDate": "2025-01-01",
      "authors": [
        {
          "authorId": "2342847001",
          "name": "A. Ferraioli"
        },
        {
          "authorId": "2360501336",
          "name": "Carotenuto Ternullo"
        },
        {
          "authorId": "2342858698",
          "name": "A. Maiorino"
        },
        {
          "authorId": "2342859801",
          "name": "F. Giannetti"
        },
        {
          "authorId": "2342859795",
          "name": "C. Aprea"
        }
      ],
      "abstract": "Phase Change Materials (PCMs) offer a promising solution for thermal energy storage (TES) in refrigeration, especially for critical applications like medicine and food preservation. This paper presents a new modelling approach to optimise PCM performance in cold storage systems. The research uses the Enthalpy-Porosity Model (EPM) to simulate PCM solidification and melting processes. This model offers a more accurate prediction than simpler methods and accounts for natural convection effects. The FreeFem++ toolbox and Galerkin method are employed for numerical solutions, enabling efficient parallel computing. By precisely modelling the phase change behaviour, the proposed method aids in designing high-efficiency and reliable cold storage systems with PCMs. This research contributes to advancements in PCM technology for sustainable refrigeration solutions."
    },
    {
      "paperId": "6694f98e66180bc55f2c3eb50fdfc1548ec5a748",
      "url": "https://www.semanticscholar.org/paper/6694f98e66180bc55f2c3eb50fdfc1548ec5a748",
      "title": "Bounds for higher Steklov and mixed Steklov Neumann eigenvalues on domains with holes",
      "openAccessPdf": {
        "url": "",
        "status": null,
        "license": null,
        "disclaimer": "Notice: Paper or abstract available at https://arxiv.org/abs/2412.17124, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
      },
      "publicationDate": "2024-12-22",
      "authors": [
        {
          "authorId": "2276608326",
          "name": "Sagar Basak"
        },
        {
          "authorId": "7883726",
          "name": "Sheela Verma"
        }
      ],
      "abstract": "In this article, we study Steklov eigenvalues and mixed Steklov Neumann eigenvalues on a smooth bounded domain in $\\mathbb{R}^{n}$, $n \\geq 2$, having a spherical hole. We focus on two main results related to Steklov eigenvalues. First, we obtain explicit expression for the second nonzero Steklov eigenvalue on concentric annular domain. Secondly, we derive a sharp upper bound of the first $n$ nonzero Steklov eigenvalues on a domain $\\Omega \\subset \\mathbb{R}^{n}$ having symmetry of order $4$ and a ball removed from its center. This bound is given in terms of the corresponding Steklov eigenvalues on a concentric annular domain of the same volume as $\\Omega$. Next, we consider the mixed Steklov Neumann eigenvalue problem on $4^{\\text{th}}$ order symmetric domains in $\\mathbb{R}^{n}$ having a spherical hole and obtain upper bound of the first $n$ nonzero eigenvalues. We also provide some examples to illustrate that symmetry assumption in our results is crucial. Finally, We make some numerical observations about these eigenvalues using FreeFEM++ and state them as conjectures."
    },
    {
      "paperId": "ac6708076c051c0d3adbee853b451ee58cca75aa",
      "url": "https://www.semanticscholar.org/paper/ac6708076c051c0d3adbee853b451ee58cca75aa",
      "title": "FreeFEM analysis of thermally induced higher-grade Darcy-Forchheimer flow through heated semi-circular cylinders",
      "openAccessPdf": {
        "url": "",
        "status": "CLOSED",
        "license": null,
        "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.1088/1402-4896/ada194?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.1088/1402-4896/ada194, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
      },
      "publicationDate": "2024-12-19",
      "authors": [
        {
          "authorId": "2266581964",
          "name": "Muhammad Sabeel Khan"
        },
        {
          "authorId": "2336400341",
          "name": "Azmat Urunbayev"
        }
      ],
      "abstract": "In this article, a higher grade Darcy-Forchheimer porous model is derived by using the concepts of tensor calculus. The model presented is accounting for non-linear flow behavior at highly permeable media where the flow is induced by temperature boundary conditions. To this end, a square geometry with two semi-circular heating cylinders mounted at its bottom wall is considered for the analysis of thermal flow dynamics. To solve the obtained coupled system of highly nonlinear partial differential equations the finite element procedure is adopted. Weak formulation of the problem is calculated via the application of variational calculus. The numerical algorithm is implemented through the open source code FreeFEM++. Obtained solutions are validated by reduced model with exact solutions. Mesh independence of the solution is shown through mesh independence analysis test. Results are computed for varying physical parameters with some interesting new observations. Moreover, streamline plots for the velocities and isotherms are shown and discussed. It is found that the Nusselt number increases with increasing Grashhoff and Frochheimer numbers, but decreases with increasing medium porosity."
    },
    {
      "paperId": "d4b35702d2d9ab5dbbc9d4499af1998ad4d3277e",
      "url": "https://www.semanticscholar.org/paper/d4b35702d2d9ab5dbbc9d4499af1998ad4d3277e",
      "title": "Application of the Phase Field Approach for Crack Propagation in Viscoelastic Solid Materials under Thermal Stress: A Case Study of Solder Fracturing",
      "openAccessPdf": {
        "url": "",
        "status": "CLOSED",
        "license": null,
        "disclaimer": "Notice: Paper or abstract available at https://api.unpaywall.org/v2/10.37934/arnht.28.1.94108?email=<INSERT_YOUR_EMAIL> or https://doi.org/10.37934/arnht.28.1.94108, which is subject to the license by the author or copyright owner provided with this content. Please go to the source to verify the license and copyright information for your use."
      },
      "publicationDate": "2024-12-18",
      "authors": [
        {
          "authorId": "95071091",
          "name": "S. Alfat"
        },
        {
          "authorId": "2162752243",
          "name": "La Ode Ahmad Barata"
        },
        {
          "authorId": "2336185001",
          "name": "Aditya Rachman"
        },
        {
          "authorId": "78266818",
          "name": "R. Eso"
        },
        {
          "authorId": "2205118036",
          "name": "Arman Arman"
        },
        {
          "authorId": "2103039251",
          "name": "Nurgiantoro Nurgiantoro"
        },
        {
          "authorId": "2336177882",
          "name": "Ali Mulya Rende"
        }
      ],
      "abstract": "To date, solder has been a crucial component for interconnecting circuit boards (PCBs) and electronic components in the electronics industry. However, solder faces certain challenges, such as cracking due to thermal changes. This paper investigates solder cracking under thermal expansion. We employ a phase field model to study crack propagation under thermal stress in a square domain and in solder with a fillet shape. The model is based on those proposed by Takaishi-Kimura and Alfat, where the stress and strain tensors are modified to account for variations in the temperature field. In this study, we consider the solder material to be viscoelastic, while the other materials are treated as homogeneous and isotropic. A numerical example is computed using the adaptive mesh finite element method, with the code implemented in FreeFEM software. The results of this study are in good agreement with previous numerical and experimental findings."
    }
  ]
}