{
  "articles": [
    {
      "paperId": "6694f98e66180bc55f2c3eb50fdfc1548ec5a748",
      "url": "https://www.semanticscholar.org/paper/6694f98e66180bc55f2c3eb50fdfc1548ec5a748",
      "title": "Bounds for higher Steklov and mixed Steklov Neumann eigenvalues on domains with holes",
      "abstract": "In this article, we study Steklov eigenvalues and mixed Steklov Neumann eigenvalues on a smooth bounded domain in $\\mathbb{R}^{n}$, $n \\geq 2$, having a spherical hole. We focus on two main results related to Steklov eigenvalues. First, we obtain explicit expression for the second nonzero Steklov eigenvalue on concentric annular domain. Secondly, we derive a sharp upper bound of the first $n$ nonzero Steklov eigenvalues on a domain $\\Omega \\subset \\mathbb{R}^{n}$ having symmetry of order $4$ and a ball removed from its center. This bound is given in terms of the corresponding Steklov eigenvalues on a concentric annular domain of the same volume as $\\Omega$. Next, we consider the mixed Steklov Neumann eigenvalue problem on $4^{\\text{th}}$ order symmetric domains in $\\mathbb{R}^{n}$ having a spherical hole and obtain upper bound of the first $n$ nonzero eigenvalues. We also provide some examples to illustrate that symmetry assumption in our results is crucial. Finally, We make some numerical observations about these eigenvalues using FreeFEM++ and state them as conjectures.",
      "publicationDate": "2024-12-22",
      "authors": [
        {
          "authorId": "2276608326",
          "name": "Sagar Basak"
        },
        {
          "authorId": "7883726",
          "name": "Sheela Verma"
        }
      ]
    },
    {
      "paperId": "ac6708076c051c0d3adbee853b451ee58cca75aa",
      "url": "https://www.semanticscholar.org/paper/ac6708076c051c0d3adbee853b451ee58cca75aa",
      "title": "FreeFEM analysis of thermally induced higher-grade Darcy-Forchheimer flow through heated semi-circular cylinders",
      "abstract": "\n In this article, a higher-grade Darcy-Forchheimer porous model is derived by using the concepts of tensor calculus. The model presented is accounting for non-linear flow behavior at highly permeable media where the flow is induced by temperature boundary conditions. To this end, a square geometry with two semi-circular heating cylinders mounted at its bottom wall is considered for the analysis of thermal flow dynamics. To solve the obtained coupled system of highly nonlinear partial differential equations the finite element procedure is adopted. Weak formulation of the problem is calculated via the application of variational calculus. The numerical algorithm is implemented through the open source code FreeFEM++. Obtained solutions are validated by reduced model with exact solutions. Mesh independence of the solution is shown through mesh independence analysis test. Results are computed for varying physical parameters with some interesting new observations. Moreover, streamline plots for the velocities and isotherms are shown and discussed. It is found that the Nusselt number increases with increasing Grashhoff and Frochheimer numbers, but decreases with increasing medium porosity.",
      "publicationDate": "2024-12-19",
      "authors": [
        {
          "authorId": "2266581964",
          "name": "Muhammad Sabeel Khan"
        },
        {
          "authorId": "2336400341",
          "name": "Azmat Urunbayev"
        }
      ]
    },
    {
      "paperId": "d4b35702d2d9ab5dbbc9d4499af1998ad4d3277e",
      "url": "https://www.semanticscholar.org/paper/d4b35702d2d9ab5dbbc9d4499af1998ad4d3277e",
      "title": "Application of the Phase Field Approach for Crack Propagation in Viscoelastic Solid Materials under Thermal Stress: A Case Study of Solder Fracturing",
      "abstract": "To date, solder has been a crucial component for interconnecting circuit boards (PCBs) and electronic components in the electronics industry. However, solder faces certain challenges, such as cracking due to thermal changes. This paper investigates solder cracking under thermal expansion. We employ a phase field model to study crack propagation under thermal stress in a square domain and in solder with a fillet shape. The model is based on those proposed by Takaishi-Kimura and Alfat, where the stress and strain tensors are modified to account for variations in the temperature field. In this study, we consider the solder material to be viscoelastic, while the other materials are treated as homogeneous and isotropic. A numerical example is computed using the adaptive mesh finite element method, with the code implemented in FreeFEM software. The results of this study are in good agreement with previous numerical and experimental findings.",
      "publicationDate": "2024-12-18",
      "authors": [
        {
          "authorId": "95071091",
          "name": "S. Alfat"
        },
        {
          "authorId": "2307115313",
          "name": "La Ode Ahmad Barata"
        },
        {
          "authorId": "2336185001",
          "name": "Aditya Rachman"
        },
        {
          "authorId": "78266818",
          "name": "R. Eso"
        },
        {
          "authorId": "2205118036",
          "name": "Arman Arman"
        },
        {
          "authorId": "2103039251",
          "name": "Nurgiantoro Nurgiantoro"
        },
        {
          "authorId": "2336177882",
          "name": "Ali Mulya Rende"
        }
      ]
    },
    {
      "paperId": "27cc055b8d73033613670223f7548f255decb264",
      "url": "https://www.semanticscholar.org/paper/27cc055b8d73033613670223f7548f255decb264",
      "title": "Asymptotic homogenization, domain decomposition and finite elements combined for calculating effective elastic properties of periodic fiber-reinforced composites with imperfect interfaces",
      "abstract": "A methodology is presented for calculating the effective elastic properties of periodic multi-phase composites made of an anisotropic linear elastic matrix reinforced with a periodical distribution of unidirectional fibers and exhibiting spring-type imperfect contacts at the interfaces. The periodicity cell contains any finite number of parallel fibers and exhibits arbitrary cross-section. Fibers also exhibit arbitrary cross-sections and are made of a different anisotropic linear elastic material each. The methodology uses asymptotic homogenization (AH) to obtain the mathematical expressions of the effective properties and to formulate the so-called local problems on the periodicity cell on whose solutions the effective properties depend on. In order to deal with the discontinuities arising from the spring-type interfaces, the local problems are then restated via domain decomposition (DD) in a way allowing for an iterative resolution scheme in which the solution of the problem to be solve in each iteration is obtained via finite elements (FE). Results in the examples are obtained via a computational implementation of the methodology based on the FreeFEM open-source software, which allows for the variational formulation of the iteration problem to be dealt with directly.",
      "publicationDate": "2024-12-02",
      "authors": [
        {
          "authorId": "1484897637",
          "name": "J. A. Mesejo-Chiong"
        },
        {
          "authorId": "2288101223",
          "name": "´Angela M. Le´on-Mec´ıas"
        },
        {
          "authorId": "2340456032",
          "name": "Leslie D. P´erez-Fern´andez"
        },
        {
          "authorId": "2340450311",
          "name": "Juli´an Bravo-Castillero"
        }
      ]
    },
    {
      "paperId": "22886d302d3129bccda8bff5017d6d45f235a119",
      "url": "https://www.semanticscholar.org/paper/22886d302d3129bccda8bff5017d6d45f235a119",
      "title": "Magnetohydrodynamic mixed convection of nanofluid flow in a split lid driven cavity using finite element method",
      "abstract": "A computational study on the effect of magnetohydrodynamic mixed convection of nanofluid flow in a square split lid driven cavity with a block placed near the bottom wall is undertaken. Two different nanoparticles gold and alumina are considered for the study. The observations for the study are obtained by solving the non-dimensionalized governing equations by Finite Element Method with variational approach as accessible with the FreeFEM++ software. The results for different Prandtl numbers ( Pr), Richardson number ( Ri), volume fractions of nanoparticles [Formula: see text], Reynolds number (Re), and MHD parameters (M) are displayed through graphs and figures. It has been observed that the pressure distribution significantly increases with the increment in Reynolds number but both the nanoparticles behave differently. The magnetic field enhancement ( M = 0.1, 0.2, 0.5 and 0.9) decreases the velocity within the cavity. The convective heat transfer is faster in the case of Reynolds number ( Re) = 100 than in the case of Reynolds number ( Re) = 14 or 21. And also increasing the Richardson Number from 0.1 to 1.0, the average Nusselt number shows increment of ∼9.5% and with Ri = 1.0 to 10.0, an increment of ∼3% whereas decrement with higher Reynolds Number ( Re = 21, 100) for Gold and Allumina nanoparticles respectively. The present simulations have various applications for the study of natural phenomenon like climate control, meteorological and geophysical activities and industrial applications like cooling of electronics equipment, heat exchanger.",
      "publicationDate": "2024-11-01",
      "authors": [
        {
          "authorId": "2328885832",
          "name": "Ankita Dubey"
        },
        {
          "authorId": "107661296",
          "name": "B. Vasu"
        },
        {
          "authorId": "120900935",
          "name": "R. Gorla"
        },
        {
          "authorId": "1396899249",
          "name": "M. H. Borbora"
        },
        {
          "authorId": "2295382025",
          "name": "A. Chamkha"
        }
      ]
    },
    {
      "paperId": "19ff5f8bbe918595619d225199514e9fec340c44",
      "url": "https://www.semanticscholar.org/paper/19ff5f8bbe918595619d225199514e9fec340c44",
      "title": "Optimal Control of a Domestic Frost-Free Refrigerator Inlet Freezer from the Perspective of Reducing Energy Consumption",
      "abstract": "This study is dedicated to the development of a mathematical model based on shape optimal control of the inlet domestic frost-free refrigerator in the context of energy consumption reduction. A three-dimensional thermofluid model is established for the numerical studies. As the physical system (with shelves and fruits) can be seen as a porous medium, the coupled state equations of the transport mechanism (for velocity and temperature fields) are governed by Navier–Stokes–Forchheimer/Fourier equations. Then, based on the finite element method, the numerical scheme computation is made with FreeFem++ software (Version 4.6). Numerical results are shown for three different cases: empty without shelves, empty with shelves, and loaded with foods. For each case, the velocity and temperature fields’ results are discussed for the optimal configurations. The characterization of these physical parameters would help engineers in domestic frost-free refrigerator design.",
      "publicationDate": "2024-10-22",
      "authors": [
        {
          "authorId": "2268151043",
          "name": "Nacer Sellila"
        },
        {
          "authorId": "2268152057",
          "name": "W. Mouhali"
        },
        {
          "authorId": "92921711",
          "name": "M. Louaked"
        },
        {
          "authorId": "2903234",
          "name": "Houari Mechkour"
        }
      ]
    },
    {
      "paperId": "0757ef59989e6718333f4128b84fae2a6310120e",
      "url": "https://www.semanticscholar.org/paper/0757ef59989e6718333f4128b84fae2a6310120e",
      "title": "Simulação da Dinâmica Populacional do Mexilhão-Dourado Utilizando o Método dos Elementos Finitos via FreeFem",
      "abstract": "Este artigo apresenta uma aplicação do método dos elementos finitos, via o software FreeFem, para resolver um modelo matemático que simula a dinâmica populacional do mexilhão-dourado, suas larvas e as algas. O modelo considera a relação predador-presa e os parâmetros físicos que influenciam o comportamento dessas espécies. A simulação, realizada em diferentes domínios, permite visualizar a concentração do mexilhão-dourado após um ano de experimento. O objetivo é compreender como diferentes condições ambientais afetam a propagação dessa espécie exótica, que é uma praga no Brasil, e assim contribuir para o desenvolvimento de estratégias de controle mais eficazes e menos onerosas.",
      "publicationDate": "2024-10-17",
      "authors": [
        {
          "authorId": "2333489143",
          "name": "Edgard S. Theotonio"
        },
        {
          "authorId": "2333487575",
          "name": "R. Z. S. Azevedo"
        },
        {
          "authorId": "2093005249",
          "name": "L. Catabriga"
        }
      ]
    },
    {
      "paperId": "f0e89a7a55852a2ac678d3ab80c3a36953e61bb6",
      "url": "https://www.semanticscholar.org/paper/f0e89a7a55852a2ac678d3ab80c3a36953e61bb6",
      "title": "Far-field sound field estimation using robotized measurements and the boundary elements method",
      "abstract": "Sound Field Estimation (SFE) is a numerical technique widely used to identify and reconstruct the acoustic fields radiated by unknown structures. In particular, SFE proves to be useful when data is only available close to the source, but information in the whole space is required. However,\n the practical implementation of this method is still hindered by two major drawbacks: the lack of efficient implementation of existing numerical methodologies, and the time-consuming and tedious roll-out of acoustic measurements. This paper aims to provide a solution to both issues. First,\n the measurements step is fully automated by using a robotic arm, able to accurately gather geometric and acoustic data without any human assistance. In this matter, a particular attention has been paid to the impact of the robot on the acoustic pressure measurements. The sound field prediction\n is then tackled using the Boundary Element Method (BEM), and implemented using the FreeFEM++ BEM library. Numerically simulated measurements have allowed us to assess the method accuracy, and the overall solution has been successfully tested using actual robotized measurements of an unknown\n loudspeaker.",
      "publicationDate": "2024-10-04",
      "authors": [
        {
          "authorId": "2273981648",
          "name": "Caroline Pascal"
        },
        {
          "authorId": "2325272834",
          "name": "Pierre Marchand"
        },
        {
          "authorId": "2274002942",
          "name": "Alexandre Chapoutot"
        },
        {
          "authorId": "2273983195",
          "name": "Olivier Doaré"
        }
      ]
    },
    {
      "paperId": "35b39f7f0aa82a86f348659b17220113a46da9da",
      "url": "https://www.semanticscholar.org/paper/35b39f7f0aa82a86f348659b17220113a46da9da",
      "title": "Investigation of the Output Voltage of a Piezoresistive MEMS Pressure Sensor Using Finite Element Modelling",
      "abstract": "In this paper, based on a 3D finite element model of a piezoresistive MEMS pressure sensor developed previously using FreeFem++, the output voltage of the device is calculated via three approaches. In the first approach, the output voltage is calculated using the widely used empirical formula for the Wheatstone bridge circuits, and thus, it is called the empirical result. In the second approach, firstly, the mean stresses are obtained within the four P-type resistors and the resistivity of the resistors is calculated using the constitutive relation of piezoresistivity. Then a steady state equation of the electric potential is solved and the electric potentials are extracted at the corner of the Cu interconnects. Thus, their difference yields the output voltage and it is called the semi-empirical result. However, within the resistors, the distribution of stresses are in fact quite inhomogeneous and thus their resistivity is also inhomogeneous. Hence, in the third approach, the resistivity of the four resistors are determined as functions of the stresses within the resistors using the constitutive relation of piezoresistivity. Then the electrical potential is also obtained numerically and the output voltages are extracted. The result obtained using the third approach is thus called the numerical result, which is the accurate output voltage of the pressure sensor determined numerically. During the simulations, the influences of different thicknesses of the silicon diaphragm, different widths of the P-type silicon resistor, and different distances between the center of the diaphragm and the midpoint of the P-type silicon resistor, are studied. The three results mentioned above are compared. Simulations show that the three results qualitatively agree with each other with the output voltage from the third approach being 30% higher. We argue, though the widely used empirical result leads to a less accurate output voltage, but it can still achieve the purpose of aiding the design of a piezoresistive MEMS pressure sensor satisfactorily.",
      "publicationDate": "2024-08-07",
      "authors": [
        {
          "authorId": "2322714126",
          "name": "Yuqing Xia"
        },
        {
          "authorId": "2296559637",
          "name": "Peng Zhou"
        },
        {
          "authorId": "2322825870",
          "name": "Chunming Zhou"
        },
        {
          "authorId": "2322541290",
          "name": "Yubao Zhen"
        },
        {
          "authorId": "2296674876",
          "name": "Xiyao Du"
        }
      ]
    },
    {
      "paperId": "7081de83579b919cf91181d99796dd1355bfb9d3",
      "url": "https://www.semanticscholar.org/paper/7081de83579b919cf91181d99796dd1355bfb9d3",
      "title": "A Domain Decomposition Finite Element Method for the Magneto-Thermal Field Analysis of Electric Machines",
      "abstract": "In this paper, a domain decomposition finite element method is proposed for the magneto-thermal field analysis of electric machines. 2-D and 3-D numerical models are built for the magnetic field and thermal field of electric machines, respectively. The computational domains of these two fields are decomposed into subdomains based on the discretized meshes to balance the computation work between processors. With the decomposed subdomains, the additive Schwarz method is developed to solve the forming numerical problems of these two fields using the open source platform freefem++, and a significant improvement in efficiency can be observed from the numerical results of single field analysis of a permanent magnet synchronous machine (PMSM). The coupling between these two fields is modelled with the electromagnetic losses and temperature dependent properties, and a two-step searching algorithm is developed for the data mapping between field solvers, which employ different dimensional models and inconsistent meshes. The counterpart subdomain is determined before searching the counterpart element to reduce the computation effort of searching. The magneto-thermal field analysis of the studied PMSM is finally conducted with the proposed method to showcase its effectiveness.",
      "publicationDate": "2024-06-02",
      "authors": [
        {
          "authorId": "2145041466",
          "name": "Yunpeng Zhang"
        },
        {
          "authorId": "2312000241",
          "name": "Jinpeng Cheng"
        },
        {
          "authorId": "91440392",
          "name": "Xinsheng Yang"
        },
        {
          "authorId": "2311851116",
          "name": "Qibin Zhou"
        },
        {
          "authorId": "2311713881",
          "name": "Weinong Fu"
        }
      ]
    }
  ]
}