{
  "readme": "This is a list of scientific articles referencing FreeFEM. Please add the latest articles at the top of the list and use the Date.prototype.toJSON() format",
  "articles": [
    {
      "title": "A new unified stabilized mixed finite element method of the Stokes-Darcy coupled problem: Isotropic discretization",
      "authors": "Houédanou Koffi Wilfrid",
      "date": "2019-08-05T23:00:00.000Z",
      "abstract": "In this paper we develop an a priori error analysis of a new unified mixed finite element method for the coupling of fluid flow with porous media flow in ℝN, N∈{2,3} on isotropic meshes. Flows are governed by the Stokes and Darcy equations, respectively, and the corresponding transmission conditions are given by mass conservation, balance of normal forces, and the Beavers-Joseph-Saffman law. The approach utilizes a modification of the Darcy problem which allows us to apply a variant nonconforming Crouzeix-Raviart finite element to the whole coupled Stokes-Darcy problem. The well-posedness of the finite element scheme and its convergence analysis are derived. Finally, the numerical experiments are presented, which confirm the excellent stability and accuracy of our method.",
      "link": "https://arxiv.org/abs/1908.01892"
    },
    {
      "title": "Finite Element Simulation, Fabrication and Characterization of Vertical Field Effect Transistors in Narrowing Nanopores for Biomolecule Detection",
      "authors": "J. R. Sauer, C. Rodriguez-Quijada, J. Cohen, M. Kalashnikov, J. Campbell, A. K. Boardman, K. Vossough, H. Wirz, F. Hecht, and A. F. Sauer-Budge",
      "date": "2019-07-30T23:00:00.000Z",
      "abstract": "To enable the high-throughput study of single molecules in solution phase, we have been developing a semiconductor nanopore sensor array for biomolecule analysis. Our silicon-based nanopores have embedded vertical field effect transistors (FETs) in the walls of an inverted pyramidal nanopore (npFETs). This geometry was chosen in part because etching allows small pore exit dimensions with length tolerances largely controlled by the surface etch mask while epitaxial growth enables well-defined field effect transistor axial dimensions. This design is fundamentally different from other nanopore detection schemes, which measure current flowing through or across an occupied pore. Other FET detection methods require the adsorption of analytes onto coated surfaces to measure binding, whereas our sensors are designed to respond to the charges present on a passing protein. Molecules are moved through the pore by electro-osmosis force (EOF). Biomolecule analysis is performed as the variations in the charge structure of molecules passing near the FET gate regions cause detectable variations in source-drain current that can be used to characterize the passing molecule. This is possible because the EOF partially descreens the molecules, permitting sensing from distances greater than several Debye lengths. We undertook simulation efforts to better understand the potential of this nanopore design. The finite element simultaneous solution of the Poisson-Nernst-Plank ion transport and Navier-Stokes fluid flow equations was achieved by alternating between iterative Newton solutions until quantities common to both sets of equations were consistent. According to our simulations, the flow dynamics through the pore's constricting geometry force biomolecules of both charges close enough to the sensor surface for detection. In this paper, we present a finite element simulation of narrowing nanopores, the fabrication of such nanopore arrays, and electrical characterization of the embedded npFETs. This work lays the foundation for the future study of individual protein measurements.",
      "link": "https://www.doi.org/10.13140/RG.2.2.22591.25767"
    },
    {
      "title": "Numerical analysis of a projection-based stabilized POD-ROM for incompressible flows",
      "authors": "Samuele Rubino",
      "date": "2019-07-23T23:00:00.000Z",
      "abstract": "In this paper, we propose a new stabilized projection-based POD-ROM for the numerical simulation of incompressible flows. The new method draws inspiration from successful numerical stabilization techniques used in the context of Finite Element (FE) methods, such as Local Projection Stabilization (LPS). In particular, the new LPS-ROM is a velocity-pressure ROM that uses pressure modes as well to compute the reduced order pressure, needed for instance in the computation of relevant quantities, such as drag and lift forces on bodies in the flow. The new LPS-ROM circumvents the standard discrete inf-sup condition for the POD velocity-pressure spaces, whose fulfillment can be rather expensive in realistic applications in Computational Fluid Dynamics (CFD). Also, the velocity modes does not have to be neither strongly nor weakly divergence-free, which allows to use snapshots generated for instance with penalty or projection-based stabilized methods. The numerical analysis of the fully Navier-Stokes discretization for the new LPS-ROM is presented, by mainly deriving the corresponding error estimates. Numerical studies are performed to discuss the accuracy and performance of the new LPS-ROM on a two-dimensional laminar unsteady flow past a circular obstacle.",
      "link": "https://arxiv.org/abs/1907.09213"
    },
    {
      "title": "Crystal elasto-plasticity on the Poincaré half-plane",
      "authors": "Edoardo Arbib, Paolo Biscari, Luca Bortoloni, Clara Patriarca, Giovanni Zanzotto",
      "date": "2019-07-21T23:00:00.000Z",
      "abstract": "We explore the nonlinear variational modelling of two-dimensional (2D) crystal plasticity based on strain energies which are invariant under the full symmetry group of 2D lattices. We use a natural parameterization of strain space via the upper complex Poincaré half-plane. This transparently displays the constraints imposed by lattice symmetry on the energy landscape. Quasi-static energy minimization naturally induces bursty plastic flow and shape change in the crystal due to the underlying coordinated basin-hopping local strain activity. This is mediated by the nucleation, interaction, and annihilation of lattice defects occurring with no need for auxiliary hypotheses. Numerical simulations highlight the marked effect of symmetry on all these processes. The kinematical atlas induced by symmetry on strain space elucidates how the arrangement of the energy extremals and the possible bifurcations of the strain-jump paths affect the plastification mechanisms and defect-pattern complexity in the lattice.",
      "link": "https://arxiv.org/abs/1907.09037"
    },
    {
      "title": "A CFD Study of Flow Around an Elevator Towards Potential Kinetic Energy Harvesting",
      "authors": "Jia Hui Ang, Y Yusup, Sheikh Ahmad Zaki Shaikh Salim, Mardiana Idayu Ahmad",
      "date": "2019-07-15T23:00:00.000Z",
      "abstract": "The  regenerative  drive  and  braking  elevator  technology  capture  the  kinetic  energy from the rope movement based on Faraday’s law of electromagnetic induction, thus only applicable to the roped elevator system. The rope-less elevator is anticipated to be  future  predominant  elevator  type  and  can  only  transfer  its  kinetic  energy  via  the airflow induced by its car movement, which can be evaluated via aerodynamic studies. However, past aerodynamic studies focus only on the effect of the induced airflow to energy and operational efficiency of the elevator. There are very limited studies on the use of the induced airflow for kinetic energy harvesting. Therefore, thisstudy evaluates the induced flow in terms ofairvelocity, kinematic pressure, and turbulence, towards the  potential  kinetic  energy  harvesting  pertaining  to  the  possibility  of  wind  power generation and electricity generation of the rope-less elevator system using CFD based approach  through  OpenFOAMsoftware.  Aerodynamics  of  the  elevator  system  is simulated   using   symmetrical   quarter   three-dimensional   elevator   model,   with parameters of car rated speed and shaft height. The results reveal the potential kinetic energy harvesting from the moving elevator car. Appropriate elevator speed and shaft height should be adjusted accordingly to get the optimum match with the longest time period for the car to run at its rated speed, to generate the most electricity.",
      "link": "https://www.akademiabaru.com/doc/ARFMTSV59_N1_P54_65.pdf"
    },
    {
      "title": "A linear, stabilized, non-spatial iterative, partitioned time stepping method for the nonlinear Navier–Stokes/Navier–Stokes interaction model",
      "authors": "Jian Li, Pengzhan Huang, Jian Su and Zhangxin Chen",
      "date": "2019-07-03T23:00:00.000Z",
      "abstract": "In this paper, a linear, stabilized, non-spatial iterative, partitioned time stepping method is developed and studied for the nonlinear Navier–Stokes/Navier–Stokes interaction. A backward Euler scheme is utilized for the temporal discretization while a linear Oseen scheme for the trilinear term is used to affect the spatial discretization approximated by the equal order elements. Therefore, we only solve a linear Stokes problem without spatial iterative per time step for each individual domain. Then, the method exploits properties of the Navier–Stokes/Navier–Stokes system to establish the stability and convergence by rigorous analysis. Finally, numerical experiments are presented to show the performance of the proposed method.",
      "link": "https://doi.org/10.1186/s13661-019-1220-2"
    },
    {
      "title": "Stability properties of the mean flow after a steady symmetry-breaking bifurcation and prediction of the nonlinear saturation",
      "authors": "Simone Camarri, Giacomo Mengali",
      "date": "2019-07-02T23:00:00.000Z",
      "abstract": "In this paper, it is shown that when a flow undergoes a steady bifurcation breaking one reflection symmetry, the mean flow obtained by averaging the two possible asymmetric flow fields resulting from the instability remains marginally stable in the postcritical regime. This property is demonstrated rigorously through an asymptotic analysis which closely follows that proposed in Sipp and Lebedev (J Fluid Mech 792:620–657, 2007) for a Hopf bifurcation with focus on wakes. In the case of wakes, the marginal stability of the mean flow is well known and had several consequences documented in the literature. To the authors’ knowledge, the marginal stability of mean flows after a symmetry-breaking pitchfork bifurcation is demonstrated here for the first time. As an example of possible consequences of marginal stability, the self-consistent model proposed for wakes in Mantič-Lugo et al. (Phys Rev Lett 113:084501, 2014) and relying on marginal stability is also applied here to the symmetry-breaking instability of the flow in a channel with a sudden expansion. For this specific case, the marginal stability of the mean flow is first demonstrated by dedicated direct numerical simulations; successively, it is shown that the resulting self-consistent model predicts the nonlinear saturation of the instability with remarkable accuracy.",
      "link": "https://doi.org/10.1007/s00707-019-02456-1"
    },
    {
      "title": "Model order reduction in aerodynamics: Review and applications",
      "authors": "Gonçalo Mendonça, Frederico Afonso, Fernando Lau",
      "date": "2019-06-11T23:00:00.000Z",
      "abstract": "The need of the aerospace industry, at national or European level, of faster yet reliable computational fluid dynamics models is the main drive for the application of model reduction techniques. This need is linked to the time cost of high-fidelity models, rendering them inefficient for applications like multi-disciplinary optimization. With the goal of testing and applying model reduction to computational fluid dynamics models applicable to lifting surfaces, a bibliographical research covering reduction of nonlinear, dynamic, or steady models was conducted. This established the prevalence of projection and least mean squares methods, which rely on solutions of the original high-fidelity model and their proper orthogonal decomposition to work. Other complementary techniques such as adaptive sampling, greedy sampling, and hybrid models are also presented and discussed. These projection and least mean squares methods are then tested on simple and documented benchmarks to estimate the error and speed-up of the reduced order models thus generated. Dynamic, steady, nonlinear, and multiparametric problems were reduced, with the simplest version of these methods showing the most promise. These methods were later applied to single parameter problems, namely the lid-driven cavity with incompressible Navier–Stokes equations and varying Reynolds number, and the elliptic airfoil at varying angles of attack for compressible Euler flow. An analysis of the performance of these methods is given at the end of this article, highlighting the computational speed-up obtained with these techniques, and the challenges presented by multiparametric problems and problems showing point singularities in their domain.",
      "link": "https://doi.org/10.1177/0954410019853472"
    },
    {
      "title": "A Multilevel Schwarz Preconditioner Based on a Hierarchy of Robust Coarse Spaces",
      "authors": " Hussam Al Daas, Laura Grigori, Pierre Jolivet, Pierre-Henri Tournier",
      "date": "2019-06-07T23:00:00.000Z",
      "abstract": "In this paper we present a multilevel preconditioner based on overlapping Schwarz methods for symmetric positive definite (SPD) matrices. Robust two-level Schwarz preconditioners exist in the literature to guarantee fast convergence of Krylov methods. As long as the dimension of the coarse space is reasonable, that is, exact solvers can be used efficiently, two-level methods scale well on parallel architectures. However, the factorization of the coarse space matrix may become costly at scale. An alternative is then to use an iterative method on the second level, combined with an algebraic preconditioner, such as a one-level additive Schwarz preconditioner. Nevertheless, the condition number of the resulting preconditioned coarse space matrix may still be large. One of the difficulties of using more advanced methods, like algebraic multigrid or even two-level overlapping Schwarz methods, to solve the coarse problem is that the matrix does not arise from a partial differential equation (PDE) anymore. We introduce in this paper a robust multilevel additive Schwarz preconditioner where at each level the condition number is bounded, ensuring a fast convergence for each nested solver. Furthermore, our construction does not require any additional information than for building a two-level method, and may thus be seen as an algebraic extension.",
      "link": "https://hal.archives-ouvertes.fr/hal-02151184"
    },
    {
      "title": "Bulk Actin Dynamics Drive Phase Segregation in Zebrafish Oocytes",
      "authors": "Shayan Shamipour, Roland Kardos, Shi-Lei Xue, Björn Hof, Edouard Hannezo, Carl-Philipp Heisenberg",
      "date": "2019-05-30T23:00:00.000Z",
      "abstract": "Segregation of maternal determinants within the oocyte constitutes the first step in embryo patterning. In zebrafish oocytes, extensive ooplasmic streaming leads to the segregation of ooplasm from yolk granules along the animal-vegetal axis of the oocyte. Here, we show that this process does not rely on cortical actin reorganization, as previously thought, but instead on a cell-cycle-dependent bulk actin polymerization wave traveling from the animal to the vegetal pole of the oocyte. This wave functions in segregation by both pulling ooplasm animally and pushing yolk granules vegetally. Using biophysical experimentation and theory, we show that ooplasm pulling is mediated by bulk actin network flows exerting friction forces on the ooplasm, while yolk granule pushing is achieved by a mechanism closely resembling actin comet formation on yolk granules. Our study defines a novel role of cell-cycle-controlled bulk actin polymerization waves in oocyte polarization via ooplasmic segregation.",
      "link": "https://doi.org/10.1016/j.cell.2019.04.030"
    },
    {
      "title": "A finite-element toolbox for the simulation of solid-liquid phase-change systems with natural convection",
      "authors": "Aina Rakotondrandisa, Georges Sadaka, Ionut Danaila",
      "date": "2019-05-12T23:00:00.000Z",
      "abstract": "We present and distribute a new numerical system using classical finite elements with meshad aptivity for computing two-dimensional liquid-solid phase-change systems involving natural convection. The programs are written as a toolbox for FreeFem++(www.freefem.org), a free finite-element software available for all existing operating systems.  The code implements a single domain approach. The same set of equations is solved in both liquid and solid phases: the incompressible Navier-Stokes equations with Boussinesq approximation for thermal effects. This model describes naturally the evolution of the liquid flow which is dominated by convection effects. To make it valid also in the solid phase, a Carman-Kozeny-type penalty term is added to the momentum equations. The penalty term brings progressively (through an artificial mushy region) the velocity to zero into thesolid. The energy equation is also modified to be valid in both phases using an enthalpy (temperature-transform) model introducing a regularized latent-heat term. Model equations are discretized using Galerkin triangular finite elements. Piecewise quadratic (P2)finite-elements are used for the velocity and piecewise linear (P1) for the pressure. For the temperature both P2 or P1 discretizations are possible. The coupled system of equations is integrated in time using a second-order Gear scheme. Non-linearities are treated implicitly and the resulting discrete equations are solved using a Newton algorithm. An efficient mesh adaptivity algorithm using metrics control is used to adapt the mesh every timestep. This allows us to accurately capture multiple solid-liquid interfaces present in the domain, the boundary-layer structure at the walls and the unsteady convection cells in the liquid. We present several validations of the toolbox, by simulating benchmark cases of increasing difficulty: natural convection of air, natural convection of water, melting of a phase-change material, a melting-solidification cycle, and, finally, a water freezing case. Other similar cases could be easily simulated with this toolbox, since the code structure is extremely versatile and the syntax very close to the mathematical formulation of the model.",
      "link": "https://hal.archives-ouvertes.fr/hal-02126697"
    },
    {
      "title": "On the limit configuration of four species strongly competing systems",
      "authors": "Flavia Lanzara, Eugenio Montefusco",
      "date": "2019-05-10T23:00:00.000Z",
      "abstract": "We analysed some qualitative properties of the limit configuration of the solutions of a reaction–diffusion system of four competing species as the competition rate tends to infinity. Large interaction induces the spatial segregation of the species and only two limit configurations are possible: either there is a point where four species concur, a 4-point, or there are two points where only three species concur. We characterized, for a given datum, the possible 4-point configuration by means of the solution of a Dirichlet problem for the Laplace equation.",
      "link": "https://doi.org/10.1007/s00030-019-0565-7"
    },
    {
      "title": "Analysis of Fully Discrete Mixed Finite Element Methods for Time-dependent Stochastic Stokes Equations with Multiplicative Noise",
      "authors": "Xiaobing Feng, Hailong Qiu",
      "date": "2019-05-08T23:00:00.000Z",
      "abstract": "This paper is concerned with fully discrete mixed finite element approximations of the time-dependent stochastic Stokes equations with multiplicative noise. A prototypical method, which comprises of the Euler-Maruyama scheme for time discretization and the Taylor-Hood mixed element for spatial discretization is studied in detail. Strong convergence with rates is established not only for the velocity approximation but also for the pressure approximation (in a time-averaged fashion). A stochastic inf-sup condition is established and used in a nonstandard way to obtain the error estimate for the pressure approximation in the time-averaged fashion. Numerical results are also provided to validate the theoretical results and to gauge the performance of the proposed fully discrete mixed finite methods.",
      "link": "https://arxiv.org/abs/1905.03289"
    },
    {
      "title": "Homogenization of a locally periodic oscillating boundary",
      "authors": "Srinivasan Aiyappan, Klas Pettersson",
      "date": "2019-04-26T23:00:00.000Z",
      "abstract": "This paper deals with the homogenization of a mixed boundary value problem for the Laplace operator in a domain with locally periodic oscillating boundary. The Neumann condition is prescribed on the oscillating part of the boundary, and the Dirichlet condition on a separate part. It is shown that the homogenization result holds in the sense of weak L2 convergence of the solutions and their flows, under natural hypothesis on the regularity of the domain. The strong L2 convergence of average preserving extensions of the solutions and their flows is also considered.",
      "link": "https://arxiv.org/abs/1904.11692"
    },
    {
      "title": "Guaranteed and robust L_2-norm a posteriori error estimates for 1D linear advection problems",
      "authors": "Alexandre Ern, Martin Vohral, Mohammad Zakerzadeh",
      "date": "2019-04-24T23:00:00.000Z",
      "abstract": "We propose a reconstruction-based a posteriori error estimate for linear advection problems in one space dimension. In our framework, a stable variational ultra-weak formulation is adopted, and the equivalence of the L2-norm of the error with the dual graph norm of the residual is established. This dual norm is showed to be localizable over vertex-based patch subdomains of the computational domain under the condition of the orthogonality of the residual to the piecewise affine hat functions. We show that this condition is valid for some well-known numerical methods including continuous/discontinuous Petrov--Galerkin and discontinuous Galerkin methods. Consequently, a well-posed local problem on each patch is identified, which leads to a global conforming reconstruction of the discrete solution. We prove that this reconstruction provides a guaranteed upper bound on the L2 error. Moreover, up to a constant, it also gives local lower bounds on the L2 error, where the generic constant is proven to be independent of mesh-refinement, polynomial degree of the approximation, and the advective velocity. This leads to robustness of our estimates with respect to the advection as well as the polynomial degree. All the above properties are verified in a series of numerical experiments, additionally leading to asymptotic exactness. Motivated by these results, we finally propose a heuristic extension of our methodology to any space dimension, achieved by solving local least-squares problems on vertex-based patches. Though not anymore guaranteed, the resulting error indicator is numerically robust with respect to both advection velocity and polynomial degree, for a collection of two-dimensional test cases including discontinuous solutions.",
      "link": "https://arxiv.org/abs/1904.10435v1"
    },
    {
      "title": "A tale of two airfoils: resolvent-based modelling of an oscillator vs. an amplifier from an experimental mean",
      "authors": "Sean Symon, Denis Sipp and Beverley J. McKeon",
      "date": "2019-04-23T23:00:00.000Z",
      "abstract": "The flows around a NACA 0018 airfoil at a Reynolds number of 10250 and angles of attack of alpha = 0 (A0) and alpha = 10 (A10) are modelled using resolvent analysis and limited experimental measurements obtained from particle image velocimetry. The experimental mean velocity profiles are data-assimilated so that they are solutions of the incompressible Reynolds-averaged Navier-Stokes equations forced by Reynolds stress terms which are derived from experimental data. Spectral proper orthogonal decompositions (SPOD) of the velocity fluctuations and nonlinear forcing find low-rank behaviour at the shedding frequency and its higher harmonics for the A0 case. In the A10 case, low-rank behaviour is observed for the velocity fluctuations in two bands of frequencies. Resolvent analysis of the data-assimilated means identifies low-rank behaviour only in the vicinity of the shedding frequency for A0 and none of its harmonics. The resolvent operator for the A10 case, on the other hand, identifies two linear mechanisms whose frequencies are a close match with those identified by SPOD. It is also shown that the second linear mechanism, corresponding to the Kelvin-Helmholtz instability in the shear layer, cannot be identified just by considering the time-averaged experimental measurements as a mean flow due to the fact that experimental data are missing near the leading edge. The A0 case is classified as an oscillator where the flow is organised around an intrinsic instability while the A10 case behaves like an amplifier whose forcing is unstructured. For both cases, resolvent modes resemble those from SPOD when the operator is low-rank. To model the higher harmonics where this is not the case, we add parasitic resolvent modes, as opposed to classical resolvent modes which are the most amplified, by approximating the nonlinear forcing from limited triadic interactions of known resolvent modes.",
      "link": "https://arxiv.org/abs/1904.10131"
    },
    {
      "title": "Numerical modeling of cardiomyocytes using Finite Element Method",
      "authors": "Joana Oliveira, José A. Rodrigues",
      "date": "2019-04-18T23:00:00.000Z",
      "abstract": "In recent years, the use of mathematical and geometrical models has been enabling the simulation of biological complex systems. Models of cardiac cells provide the possibility to understand the biochemistry and biomechanics of cardiac cells and cardiovascular diseases. The main objective of this work is to simulate the calcium flux and contractile activity of the cardiomyocyte, resorting on the Finite Element Method, and to develop a modelling tool with which we can simulate the key physiological aspects of the cardiac myocytes: Calcium concentration and contraction potential (% of shortening). To test our model's performance several tests were applied varying the local active cellular tension driven by the intracellular calcium concentration (Tu), and the position of T-tubules in the cell, from left to right and up to bottom. Our results show that the behaviour of our model is faithful to what is known to be true with the cell's physiology and pathological conditions.",
      "link": "https://doi.org/10.1109/ENBENG.2019.8692536"
    },
    {
      "title": "Linear iterative method for closed-loop control of quasiperiodic flows",
      "authors": "Colin Leclercq, Fabrice Demourant, Charles Poussot-Vassal and Denis Sipp",
      "date": "2019-04-08T23:00:00.000Z",
      "abstract": "This work proposes a feedback-loop strategy to suppress intrinsic oscillations of resonating flows in the fully nonlinear regime. The frequency response of the flow is obtained from the resolvent operator about the mean flow, extending the framework initially introduced by McKeon & Sharma (J. Fluid Mech., vol. 658, 2010, pp. 336–382) to study receptivity mechanisms in turbulent flows. Using this linear time-invariant model of the nonlinear flow, modern control methods such as structured -synthesis can be used to design a controller. The approach is successful in damping self-sustained oscillations associated with specific eigenmodes of the mean-flow spectrum. Despite excellent performance, the linear controller is however unable to completely suppress flow oscillations, and the controlled flow is effectively attracted towards a new dynamical equilibrium. This new attractor is characterized by a different mean flow, which can in turn be used to design a second controller. The method can then be iterated on subsequent mean flows, until the coupled system eventually converges to the base flow. An intuitive parallel can be drawn with Newton’s iteration: at each step, a linearized model of the flow response to a perturbation of the input is sought, and a new linear controller is designed, aiming at further reducing the fluctuations. The method is illustrated on the well-known case of two-dimensional incompressible open-cavity flow at Reynolds number , where the fully developed flow is initially quasiperiodic (2-torus state). The base flow is reached after five iterations. The present work demonstrates that nonlinear control problems may be solved without resorting to nonlinear reduced-order models. It also shows that physically relevant linear models can be systematically derived for nonlinear flows, without resorting to black-box identification from input–output data; the key ingredient being frequency-domain models based on the linearized Navier–Stokes equations about the mean flow. Applicability to amplifier flows and turbulent dynamics has, however, yet to be investigated.",
      "link": "https://doi.org/10.1017/jfm.2019.112"
    },
    {
      "title": "Augmented Lagrangian preconditioner for large-scale hydrodynamic stability analysis",
      "authors": "Johann Moulin, Pierre Jolivet, Olivier Marquet",
      "date": "2019-04-05T23:00:00.000Z",
      "abstract": "Hydrodynamic linear stability analysis of large-scale three-dimensional configurations is usually performed with a “time-stepping” approach, based on the adaptation of existing solvers for the unsteady incompressible Navier–Stokes equations. We propose instead to solve the nonlinear steady equations with the Newton method and to determine the largest growth-rate eigenmodes of the linearized equations using a shift-and-invert spectral transformation and a Krylov–Schur algorithm. The solution of the shifted linearized Navier–Stokes problem, which is the bottleneck of this approach, is computed via an iterative Krylov subspace solver preconditioned by the modified augmented Lagrangian (mAL) preconditioner (Benzi et al., 2011). The well-known efficiency of this preconditioned iterative strategy for solving the real linearized steady-state equations is assessed here for the complex shifted linearized equations. The effect of various numerical and physical parameters is investigated numerically on a two-dimensional flow configuration, confirming the reduced number of iterations over state-of-the-art steady-state and time-stepping-based preconditioners. A parallel implementation of the steady Navier–Stokes and eigenvalue solvers, developed in the FreeFEM language, suitably interfaced with the PETSc/SLEPc libraries, is described and made openly available to tackle three-dimensional flow configurations. Its application on a small-scale three-dimensional problem shows the good performance of this iterative approach over a direct factorization strategy, in regards of memory and computational time. On a large-scale three-dimensional problem with 75 million unknowns, a 80% parallel efficiency on 256 up to 2,048 processes is obtained.",
      "link": "https://www.sciencedirect.com/science/article/pii/S0045782519301914"
    },
    {
      "title": "A reduced basis method for parametrized variational inequalities applied to contact mechanics",
      "authors": "Amina Benaceur, Alexandre Ern, Virginie Ehrlacher",
      "date": "2019-03-27T23:00:00.000Z",
      "abstract": "We investigate new developments of the Reduced-Basis (RB) method for parametrized optimization problems with nonlinear constraints. We propose a reduced-basis scheme in a saddle-point form combined with the Empirical Interpolation Method to deal with the nonlinear constraint. In this setting, a primal reduced-basis is needed for the primal solution and a dual one is needed for the Lagrange multipliers. We suggest to construct the latter using a cone-projected greedy algorithm that conserves the non-negativity of the dual basis vectors. The reduction strategy is applied to elastic frictionless contact problems including the possibility of using non-matching meshes. The numerical examples confirm the efficiency of the reduction strategy.",
      "link": "https://hal.archives-ouvertes.fr/hal-02081485/file/contact.pdf"
    },
    {
      "title": "Effect of soluble surfactants on vertical liquid film drainage",
      "authors": "Chunxi Li (李春曦), Minglan Li (李明兰), Zhixian Shi (施智贤), and Xuemin Ye (叶学民)",
      "date": "2019-03-22T23:00:00.000Z",
      "abstract": "A mathematical model is established to investigate the gravity-driven drainage of vertical films containing a soluble surfactant by considering the coupling effect of surface elasticity, adsorption coefficient, and surfactant solubility. The lubrication theory is applied to derive the four coupled nonlinear partial differential equations describing the film thickness, surface velocity, and surfactant concentration on the surface and in the bulk. Simulated results showed that the surface elasticity, adsorption coefficient, and surfactant solubility are indispensable factors in the drainage process of a liquid film containing a soluble surfactant. In the initial stage of the drainage, the initial film thickness increases with increasing surface elasticity and the film surface tends to be more rigid. With further drainage, the liquid film exhibits different notable features for high and low elasticity. For low surface elasticity, the surfactant distribution produces a positive Marangoni effect, which counteracts gravity. However, for high surface elasticity, the film surface exhibits a reverse Marangoni effect, which accelerates the drainage and leads to an unstable film. As the solubility decreases, both the film stability and initial surface elasticity enhance. The surface elasticity gradually approaches a limiting dilational elasticity modulus owing to the film thinning. For a large Ks, the film surface is insufficient to produce a strong Marangoni effect and then the liquid film tends to easily destabilize. For a small Ks, the soluble surfactant is similar to an insoluble surfactant, and the film is much thicker in the later stage of the drainage.",
      "link": "https://aip.scitation.org/doi/full/10.1063/1.5085791"
    },
    {
      "title": "The EMAC Scheme for Navier-Stokes Simulations, and Application to Flow Past Bluff Bodies",
      "authors": "S. Charnyi",
      "date": "2019-03-05T23:00:00.000Z",
      "abstract": "The Navier-Stokes equations model the evolution of water, oil, and air flow (air under220 m.p.h.), and therefore the ability to solve them is important in a wide array of engineering design problems. However, analytic solution of these equations is generally not possible, except for a few trivial cases, and therefore numerical methods must be employed to obtain solutions. In the present dissertation we address several important issues in the area of computational fluid  dynamics",
      "link": "https://search.proquest.com/openview/b19bfb91b61dc057ce2ad7c9e0677f71/1?pq-origsite=gscholar&cbl=18750&diss=y"
    },
    {
      "title": "Particle swarm optimization-based algorithms for solving inverse problems of designing thermal cloaking and shielding devices",
      "authors": "Gennady V. Alekseev, Dmitry A.Tereshkoa",
      "date": "2019-03-05T23:00:00.000Z",
      "abstract": "Inverse problems associated with designing cylindrical thermal layered shielding and cloaking shells are studied. Using the optimization method these inverse problems are reduced to corresponding control problems. Thermal conductivities of the shell layers play the role of passive controls. A numerical algorithm based on the particle swarm optimization is proposed and the results of numerical experiments are discussed. Important properties of optimal solutions are established. Based on these properties simple design rules are formulated allowing to design cloaking and shielding shells which possess the best cloaking or shielding performance in addition to easy manufacturability.",
      "link": "https://www.sciencedirect.com/science/article/pii/S0017931018356394"
    },
    {
      "title": "A Practical Review on Linear and Nonlinear Global Approaches to Flow Instabilities",
      "authors": "D. Fabre, V. Citro, D. Ferreira Sabino, P. Bonnefis, J. Sierra, F. Giannetti, M. Pigou",
      "date": "2019-02-14T23:00:00.000Z",
      "abstract": "This paper aims at reviewing linear and nonlinear approaches to study the stability of fluid flows. We provide a concise but self-contained exposition of the main concepts and specific numerical methods designed for global stability studies, including the classical linear stability analysis, the adjoint-based sensitivity, and the most recent nonlinear developments. Regarding numerical implementation, a number of ideas making resolution particularly efficient are discussed, including mesh adaptation, simple shift-invert strategy instead of the classical Arnoldi algorithm, and a simplification of the recent non-linear self-consistent (SC) approach proposed by Mantic-Lugo et al. (2014, “Self-Consistent Mean Flow Description of the Nonlinear Saturation of the Vortex Shedding inthe Cylinder Wake,” Phys. Rev. Lett., 113(8), p. 084501). An open-source software imple-menting all the concepts discussed in this paper is provided. The software is demonstrated for the reference case of the two-dimensional (2D) flow around a circular cylinder, in both incompressible and compressible cases, but is easily customizable to a variety of other flow configurations or flow equations.",
      "link": "https://www.researchgate.net/profile/Vincenzo_Citro2/publication/331167790_A_Practical_Review_on_Linear_and_Nonlinear_Global_Approaches_to_Flow_Instabilities/links/5c6a8f1d4585156b5703611a/A-Practical-Review-on-Linear-and-Nonlinear-Global-Approaches-to-Flow-Instabilities.pdf"
    },
    {
      "title": "Option Pricing with the Finite Element Method",
      "authors": "Nicolas André",
      "date": "2019-02-14T23:00:00.000Z",
      "abstract": "This work proposes to solve multidimensional financial problems using a numerical method widely known in Mechanical Engineering: the Finite Element Method.The idea of this method is to approximate the solution of a Partial Differential Equations(PDE), or a Partial Integro-Differential (PIDE) Equations, with a combination of simple functions. In other words, from a complex, infinite dimensional functional space, we want to project the solution of a given weak problem on a simpler functional space of finite dimension. This approximation is done thanks to the Galerkin method which focuses the problem on a reduced zone, divides this zone in non-overlapping subdomains, and approximates on each domain thesolution with easy functions such as polynomials. This method is here applied to financial multi-dimensional problems. Here we consider the pricing of complex derivatives such as basket options on two or three assets, under the Black-Scholes and the Merton model, and the pricing of simple products (plain vanillas) under complex models such as stochastic volatility models. This financial problems involve in general two or three dimensional parabolic PDEs or PIDEs. We have to set their variational form, choose an appriopriate approximated space, derive the linear equations solvedby the components of the approximated form. We perform this computations thanks to a special PDE solver which performs Finite Element methods, and we want to see if increasing the number dimension of the approximated subspace, by increasing the number of subdomains or the number of simple functions, we reach a solution and put a price on our derivatives.",
      "link": "https://www.politesi.polimi.it/bitstream/10589/144423/3/2018_12_Andre.pdf"
    },
    {
      "title": "Shear rate projection schemes for non–Newtonian fluids.",
      "authors": "J. Deteixa, D. Yakoubi",
      "date": "2019-02-14T23:00:00.000Z",
      "abstract": "The operator splitting approach applied to the Navier-Stokes equations, gave rise to various numerical methods for the simulations of the dynamics of fluids. The separate work of Chorin and Temam on this subject gave birth to the so-called projection methods. The basic projection schemes, either the incremental or non-incremental variant (see [1]) induces an artificial Neumann boundary condition on the pressure. By getting rid of this boundary condition on the pressure, the so-call rotational incremental pressure-correction scheme as proposed by Timmermans et al. [2] for Newtonian fluids with constant viscosity gives a consistent equation for the pressure. In this work we propose a family of projection methods for generalized Newtonian fluids based on an extension of the rotational projection scheme. Called shear rate projections, these methods produces consistent pressure when applied to generalized Newtonian fluids. Accuracy of the methods will be illustrated using a manufactured solution. Numerical experiments for the flow past a cylinder, with aCarreau rheological model, will also be presented.",
      "link": "https://arxiv.org/pdf/1902.05643.pdf"
    },
    {
      "title": "Optimal Control of Part Load Vortex Rope in Francis Turbines",
      "authors": " S. Pasche, F. Avellan, F. Gallaire",
      "date": "2019-02-13T23:00:00.000Z",
      "abstract": "The mitigation of the precessing vortex core developing in the draft tube of Francis turbines operating under part load conditions is crucial to increase the operation flexibility of these hydraulic machines to balance the massive power production of intermittent energy sources. A systematic approach following the optimal control theory is, therefore, presented to control this vortical flow structure. Modal analysis characterizes the part load vortex rope as a self-sustained instability associated with an unstable eigenmode. Based on this physical characteristic, an objective function targeting a zero value of the unstable eigenvalue growth rate is defined and subsequently minimized using an adjoint-based optimization algorithm. We determine an optimal force distribution that successfully quenches the part load vortex rope and sketches the design of a realistic control appendage.",
      "link": "https://fluidsengineering.asmedigitalcollection.asme.org/article.aspx?articleid=2722923"
    },
    {
      "title": "Mathematical modelling of convective drying of feijoa (Acca sellowiana Berg) slices",
      "authors": "A.M. Castro, E.Y. Mayorga, F.L. Moreno",
      "date": "2019-02-09T23:00:00.000Z",
      "abstract": "A two-dimensional mathematical model for coupled heat and mass transfer during convective drying of feijoa (Acca sellowiana Berg) slices was implemented. The thermophysical and transport properties were considered variable and the effective moisture diffusion coefficient was determined based on the Arrhenius-type temperature dependence. The convective heat and mass transfer coefficients were obtained from the minimization of the function in terms of the error of experimental and predicted data. The model was solved by means of the finite element method programmed in FreeFEM. This is a free software that has not been reported for fruit convective drying modelling, but this software can be used for drying modelling in fruits. The model was validated against experimental data for air velocities of 0.5 and 1 ms−1, temperatures of 50, 60, and 70 °C and slice thicknesses of 0.003 and 0.005 m through Lin's concordance correlation coefficient (ρc). Which has not been reported for validation in drying modelling though it is a reliable indicator of model agreement. Experimental data were well predicted with the model, with concordance correlation coefficients of 0.9653 and 0.9872 for moisture content and temperature, respectively. The model was found to be suitable to describe, with sufficient accuracy, the heat and mass transfer during drying, and hence, it is appropriate for engineering applications.",
      "link": "https://www.sciencedirect.com/science/article/abs/pii/S0260877419300536"
    }
  ]
}
